[
  {
    "path": "posts/2022-04-04-knn-uitleg/",
    "title": "KNN uitleg",
    "description": "Uitleg van de Machine Learning methode KNN aan de hand van een paar kleine voorbeelden in Excel.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2022-04-04",
    "categories": [
      "excel",
      "machinelearning"
    ],
    "contents": "\r\nMachine Learning is een concept waarbij via een algoritme geprobeerd\r\nwordt om patronen in gegevens te ontdekken. Een van de eenvoudigste\r\nalgoritmes is KNN, wat staat voor k-Nearest-Neighbor, oftewel\r\nde \\(k\\) dichstbijzijnde buren. Wanneer\r\nje het voor classificatie gebruikt, dan wordt een nieuw gegevenspunt in\r\neen doelgroep (klasse) ondergebracht op basis van de kenmerken van de\r\n\\(k\\) dichtstbijgelegen\r\ngegevenspunten.\r\nNu is Excel niet echt geschikt om Machine Learning technieken toe te\r\npassen. Wel kun je het principe van sommige technieken, zoals KNN, goed\r\nmet behulp van Excel uitleggen.\r\nVoorbeeld met 1 kenmerk\r\nStel je hebt een groep van 8 personen, 4 mannen en 4 vrouwen, waarvan\r\nde lengte (cm) bekend is. Bij deze groep komt nu een nieuwe persoon\r\nwaarvan je alleen de lengte weet, 176 cm. Kun je dan hiermee voorspellen\r\nof het een man of een vrouw is?\r\n\r\n\r\n\r\nFigure 1: Lengte van de personen.\r\n\r\n\r\n\r\nVoor een vergelijking zijn in figuur 2 de\r\nlengtes van alle personen op een denkbeeldige meetlat afgebeeld.\r\n\r\n\r\n\r\nFigure 2: Afbeelding van de lengte van de personen op een\r\ndenkbeeldige meetlat.\r\n\r\n\r\n\r\nHet KNN algoritme berekent nu de afstanden van de nieuwe persoon tot\r\nalle gecategoriseerde personen, waarvan het geslacht dus bekend is.\r\nOnder afstand wordt hier dan het verschil in lengte verstaan. Deze\r\nafstanden zijn te zien in figuur 1.\r\nVervolgens worden deze afstanden gerangschikt van de dichtstbijzijnde\r\n(meest vergelijkbare) tot de verste (de minst vergelijkbare).\r\nDe waarde voor \\(k\\) in het\r\nalgoritme staat voor het aantal buren waarmee je gaat vergelijken. Elk\r\nvan deze \\(k\\) buren brengt als het\r\nware een stem uit voor de desbetreffende categorie. De conclusie of de\r\nnieuwe persoon een man of een vrouw is wordt dan getrokken op basis van\r\nde meeste stemmen.\r\n\\(k=1\\): De dichtstbijzijnde\r\npersoon is M2. Conclusie: nieuwe persoon = man\r\n\\(k=2\\): De dichtstbijzijnde\r\npersonen zijn M2 en M1. Conclusie: nieuwe persoon =\r\nman\r\n\\(k=3\\): De dichtstbijzijnde\r\npersonen zijn M2, M1 en V4. Conclusie: nieuwe persoon =\r\nman\r\n\r\nOm de situatie te voorkomen waarbij de stemmen staken kun je voor \\(k\\) het beste een oneven getal nemen.\r\nVoorbeeld met 2 kenmerken\r\nNu is van de 4 mannen en 4 vrouwen naast de lengte (cm) ook het\r\ngewicht (kg) bekend. En het gewicht van de nieuwe persoon is 68 kg.\r\n\r\n\r\n\r\nFigure 3: Lengte en gewicht van de personen.\r\n\r\n\r\n\r\nIn figuur 4 is een spreidingsdiagram van\r\ngewicht tegen lengte te zien.\r\n\r\n\r\n\r\nFigure 4: Spreidingsdiagram van lengte en gewicht van de\r\npersonen.\r\n\r\n\r\n\r\nOok nu wordt weer de afstand bepaald van de nieuwe persoon tot de\r\nandere personen. Bij twee variabelen wordt de Euclidische afstand\r\nbepaald. Voor twee punten \\((x_1,y_1)\\)\r\nen \\((x_2,y_2)\\) kun je deze via\r\nPythagoras uitrekenen:\r\n\\[\\text{afstand } = \\sqrt{(x_1 - x_2)^2 +\r\n(y_1 - y_2)^2}\\]\r\nIn figuur 3 is de berekende afstand te zien.\r\nDaarna wordt weer gekeken welke de dichtstbijzijnde buren zijn.\r\n\\(k=1\\): De dichtstbijzijnde\r\npersoon is M1. Conclusie: nieuwe persoon = man\r\n\\(k=2\\): De dichtstbijzijnde\r\npersonen zijn M1 en V4. Conclusie: geen uitsluitsel, stemmen staken\r\n\\(k=3\\): De dichtstbijzijnde\r\npersonen zijn M1, V4 en V3. Conclusie: nieuwe persoon =\r\nvrouw\r\nVoorbeeld met 2 gestandaardiseerde kenmerken\r\nVerschillende variabelen hebben verschillende schaaleenheden, zoals\r\nhier de lengte in cm en het gewicht in kg. Dat kan er voor zorgen dat\r\nvariabelen die op een grotere schaal gemeten worden een groter aandeel\r\nhebben in de berekende afstand en daardoor belangrijker worden gemaakt\r\ndan variabelen die op een kleinere schaal gemeten worden. Om dit te\r\nvoorkomen kun je de gegevens transformeren naar een nieuwe schaal. Een\r\nveel gebruikte techniek hiervoor is de min-max normalisatie\r\nwaarbij de gegevens geschaald worden naar het bereik [0,1]. Hiervoor\r\nwordt de kleinste en de grootste waarde van de gegevens bepaald.\r\nVervolgens worden de gegevens gewijzigd via\r\n\\(\\text{genormaliseerde waarde } = \\frac{x\r\n- min(x)}{max(x) - min(x)}\\)\r\nIn figuur 5 zijn de variabelen lengte en\r\ngewicht genormaliseerd en is de afstand voor de genormaliseerde gegevens\r\nberekend. En in figuur 6 zie je de\r\nbijpassende grafiek.\r\n\r\n\r\n\r\nFigure 5: Lengte en gewicht van de personen.\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 6: Spreidingsdiagram van lengte en gewicht van\r\nde personen.\r\n\r\n\r\n\r\nWanneer nu naar de dichtstbijzijnde buren gekeken wordt zijn de\r\nresultaten iets anders.\r\n\\(k=1\\): De dichtstbijzijnde\r\npersoon is M1. Conclusie: nieuwe persoon = man\r\n\\(k=2\\): De dichtstbijzijnde\r\npersonen zijn M1 en V4. Conclusie: geen uitsluitsel, stemmen staken\r\n\\(k=3\\): De dichtstbijzijnde\r\npersonen zijn M1, V4 en M2. Conclusie: nieuwe persoon =\r\nman\r\nMeer dan 2 kenmerken\r\nVoor meer attributen, bijvoorbeeld door de gegevens aan te vullen met\r\nde taillemaat, is het principe hetzelfde. Je kunt het wat moeilijker\r\ntekenen en ook het berekenen van de afstand is wat meer werk.\r\n\\[\\text{afstand} = \\sqrt{(x_1 - x_2)^2 +\r\n(y_1 - y_2)^2 + (z_1 - z_2)^2 + ... }\\]\r\nkNN in de praktijk\r\nIn de praktijk heb je met grotere datasets te maken. Om de beste\r\nwaarde voor \\(k\\) te vinden wordt de\r\ndataset gesplitst in een groter deel van zo’n 70%-80% van de gegevens om\r\nhet model te trainen en een resterend kleiner deel om het model te\r\ntesten. Het trainen en testen gebeurt voor verschillende waarden van\r\n\\(k\\). Die waarde van \\(k\\) welke de kleinste voorspelfout geeft\r\nwordt dan als beste waarde voor het model gebruikt.\r\nDit alles is met Excel niet te doen. Daartoe lenen R en Python zich\r\nveel beter. Voor beide zijn veel artikelen en tutorials met voorbeelden\r\nte vinden.\r\n\r\n\r\n\r\n",
    "preview": "posts/2022-04-04-knn-uitleg/knn-2dim-grafiek.png",
    "last_modified": "2022-06-09T10:36:05+02:00",
    "input_file": {},
    "preview_width": 442,
    "preview_height": 369
  },
  {
    "path": "posts/2022-03-27-statistische-procescontrole-met-excel/",
    "title": "Statistische procescontrole met Excel",
    "description": "Een lijndiagram (regelkaart) in Excel voor het controleren van een procesvariabele.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2022-03-27",
    "categories": [
      "excel",
      "statistiek"
    ],
    "contents": "\r\nRegelkaart\r\nRegelkaarten (ook wel controlekaarten genoemd) worden bij\r\nstatistische procescontrole (SPC) gebruikt om te controleren of een\r\nprocesvariabele onder controle is. De waarde van zo’n variabele moet\r\ndaarbij binnen bepaalde grenzen blijven. Een controlekaart is in feite\r\nniets anders dan een lijndiagram van de meetwaarden van de variabele met\r\ndaarbij horizontale lijnen voor de regelgrenzen.\r\nRegelgrenzen\r\nUCL - Upper Control Limit (Bovenste controlegrens)\r\nLCL - Lower Control Limit (Onderste controlegrens)\r\nDe regelgrenzen worden uit de data berekend en worden, afhankelijk\r\nvan het soort proces, op 2-3 standaardafwijkingen van het gemiddelde\r\ngezet. Vaak zie je ook nog een horizontale lijn voor het gemiddelde op\r\nde regelkaart. Deze lijn wordt ook met CL (Centrale Lijn) aangeduid.\r\nVoorbeeld\r\nAls voorbeeld een continu chemisch proces waarbij elk uur de\r\ntemperatuur van het reactiemengsel wordt gecontroleerd. Voor een goede\r\nbeheersing van dit proces wordt vereist dat de temperatuur binnen 2\r\nstandaardafwijkingen van het gemiddelde blijft.\r\ndata en regelkaartDe gegevens zijn ondergebracht in een Excel tabel. In H1 en H2 zijn\r\nrespectievelijk het gemiddelde en de standaarddeviatie van de\r\ntemperatuur berekend.\r\nFormule kolom CL: =$H$1\r\nFormule kolom UCL: =$H$1+2*$H$2\r\nFormule kolom LCL: =$H$1-2*$H$2\r\nHet maken van de grafiek is dan vrij eenvoudig. Selecteer alle\r\ngegevens in de tabel, voeg de aanbevolen grafiek in en pas deze daarna\r\ndesgewenst aan. Het bestand met voorbeeldgegevens en regelkaart kun je\r\ndownloaden: spc.xlsx\r\nEr is op internet veel informatie over SPC en regelkaarten te vinden.\r\nEen gedegen artikel is Control\r\nLimits and Specifications: The Four Process States.\r\n\r\n\r\n\r\n",
    "preview": "posts/2022-03-27-statistische-procescontrole-met-excel/regelkaart.png",
    "last_modified": "2022-06-08T09:57:03+02:00",
    "input_file": {},
    "preview_width": 448,
    "preview_height": 322
  },
  {
    "path": "posts/2022-03-15-reeks-getallen-genereren/",
    "title": "Reeks getallen genereren",
    "description": "Een matrix met (opeenvolgende) getallen genereren met de functie REEKS.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2022-03-15",
    "categories": [
      "excel",
      "matrix"
    ],
    "contents": "\r\nDe meeste Excel gebruikers kennen wel de truc om een reeks getallen\r\nte produceren door een beginlijstje met een patroon te maken en deze\r\nvervolgens uit te breiden door de vulgreep te verslepen. Wanneer je niet\r\nmeer weet hoe dit werkt, lees dan Automatisch\r\ndoorvoeren.\r\nOm een lijst met (opeenvolgende) getallen in een matrix te genereren\r\nkun je de functie REEKS gebruiken.\r\nSyntax: REEKS(rijen;[kolommen];[beginnen];[stap])\r\nrijen: Het aantal rijen dat moet worden geretourneerd\r\n(verplicht).\r\nkolommen: Het aantal kolommen dat moet worden\r\ngeretourneerd (optioneel, default 1).\r\nbeginnen: Het eerste getal in de reeks (optioneel,\r\ndefault 1).\r\nstap: De stapgrootte (optioneel, default 1).\r\nZo kun je een kolom met de getallen 1 t/m 10 genereren met de formule\r\n=REEKS(10)\r\n\r\nEn met de formule =REEKS(5;4;5;10) krijg je een matrix\r\nvan 5 rijen en 4 kolommen, beginnend met getal 5 en de volgende steeds\r\n10 meer.\r\n\r\nJe kunt de functie REEKS ook opnemen binnen andere\r\nfuncties. Zo kun je eenvoudig een matrix met Romeinse cijfers maken. De\r\nformule in het volgende voorbeeld is =ROMEINS(REEKS(9,10)).\r\nEerst wordt met REEKS een lijst getallen van 9 rijen en 10\r\nkolommen gemaakt, beginnend met 1 en steeds 1 meer. Daarna zet de\r\nfunctie ROMEINS deze om naar Romeinse cijfers, als\r\ntekst.\r\n\r\nTot slot een wat complexer voorbeeld. Stel je hebt een persoonlijke\r\nlening van €10.000 afgesloten tegen een jaarlijkse rente van 6% die je\r\nin 24 maandelijkse termijnen aflost. Wat is dan het totaal aan rente\r\nbetaalde bedrag?\r\n\r\nHet rentedeel van een maandelijkse aflossing kun je berekenen met de\r\nfunctie\r\nIBET(rente;termijn;aantal-termijnen;huidige-waarde)\r\nJe zou dan een lijstje met de termijnen 1 t/m 24 kunnen maken en voor\r\nelke termijn het rentebedrag kunnen uitrekenen. Om de formules\r\nleesbaarder te maken zijn de cellen voor de argumenten van functie van\r\nnamen voorzien: Lening, Termijnen en Jaarrente.\r\nDe matrixformule wordt dan\r\n=IBET(Jaarrente/12;REEKS(Termijnen);Termijnen;Lening).\r\n\r\nVoor de totaal betaalde rente moet je dan deze bedragen nog\r\noptellen.\r\nJe kunt dit bedrag ook vinden zonder eerst de afzonderlijke\r\nrentebedragen te bepalen. De formule voor het totale rentebedrag wordt\r\ndan\r\n=SOM(IBET(Jaarrente/12;REEKS(Termijnen);Termijnen;Lening))\r\n\r\nAlle voorbeelden uit dit artikel kun je vinden in het bestand reeks.xlsx.\r\n\r\n\r\n\r\n",
    "preview": "posts/2022-03-15-reeks-getallen-genereren/reeks-2.png",
    "last_modified": "2022-06-08T09:57:48+02:00",
    "input_file": {},
    "preview_width": 277,
    "preview_height": 176
  },
  {
    "path": "posts/2022-03-14-powerquery-en-landinstellingen/",
    "title": "Powerquery en Landinstellingen",
    "description": "Het gebruik van landinstellingen bij het importeren van platte bestanden (.csv).",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2022-03-14",
    "categories": [
      "excel",
      "powerquery"
    ],
    "contents": "\r\nVeel gegevensbestanden zijn platte bestanden ( .txt, .csv, …). Dit\r\nsoort bestanden heeft geen metalaag of schema waarin beschreven staat\r\nhoe de gegevens geïnterpreteerd moeten worden. Wanneer deze gegevens in\r\nExcel geïmporteerd worden doet Power Query wel een poging hiertoe. Dat\r\ngaat vaak goed, maar vooral bij numerieke- en datumgegevens uit\r\nEngelstalige bronnen gaat het vaak fout.\r\nNumerieke gegevens: Engelstalige landen gebruiken een punt\r\nals decimaalteken en een komma als scheidingdteken voor duizendtallen.\r\nIn Nederland (en veel andere Europese landen) is dit precies andersom,\r\neen komma als decimaal teken en een punt voor de duizendtallen.\r\nDatums: In de VS is de opmaak meestal mm/dd/jjjj en in\r\nEuropa dd/mm/jjjj.\r\nHet is aan te raden om altijd zo’n plat bestand eerst met een\r\nprogramma als kladblok of Notepad te bekijken om dit vast te\r\nstellen.\r\nInstellingen\r\nbesturingssysteem\r\nWanneer je met een nieuw Excelbestand begint en hierin via Power\r\nQuery gegevens uit een plat bestand importeert, dan wordt door Power\r\nQuery de locale versie van het besturingssysteem gebruikt als\r\nstandaardinstelling. Met deze instelling wordt bepaald hoe Power Query\r\nde gegevens interpreteert.Je kunt in Windows deze instellingen vinden en\r\nwijzigen via Configuratiescherm > Tijd en taal >\r\nLand/regio.\r\nDe gebruikte landinstelling wordt in de query bewaard. Wanneer het\r\nExcelbestand later door een andere gebruiker met een andere\r\nlandinstelling wordt gebruikt, dan gebruikt Power Query de\r\nlandinstelling die in de query is opgeslagen, waardoor de query goed\r\nblijft werken.\r\nQuery Opties\r\nVia de Queryopties van Power Query kun je ook de te gebruiken\r\nlandinstellingen specificeren. Vanuit een Excel werkblad kies je\r\ntab Gegevens > Gegevens ophalen > Query\r\nopties.\r\nRegionale instellingen huidige\r\nwerkmapKies Regionale instellingen onder Huidige\r\nwerkmap. Bij een nieuwe werkmap staat bij landinstellingen de\r\nstandaardinstelling van het besturingssysteem. Je kunt hier een andere\r\ninstelling opgeven en deze wordt met de query bewaard. De hier\r\ngespecificeerde landinstellingen worden alleen bij de query’s gebruikt\r\nen niet op andere plekken in Excel.\r\n\r\nLET OP: Onder GLOBAAL zit ook een Regionale instellingen. Hiermee kun\r\nje alleen de taal instellen voor de automatisch gegenereerde\r\nstapnamen.\r\n\r\nWanneer je na een import ziet dat het fout gegaan is met de\r\nlandinstellingen, dan kun je ook achteraf via de Queryopties de\r\nlandinstellingen wijzigen. Daarna moet je de query opnieuw uitvoeren. De\r\nimport zou dan goed moeten verlopen.\r\nGegevenstype wijzigen\r\nTot slot kun je ook nog in de Power Query Editor de landinstellingen\r\nvoor een of meerdere kolommen wijzigen. Deze route is handig wanneer je\r\nmet verschillende landinstellingen voor meerdere query’s binnen dezelfde\r\nwerkmap moet werken. Is goed bruikbaar wanneer je voor enkele kolommen\r\nde landinstellingen wilt wijzigen en voor de andere kolommen met de\r\nstandaardinstelling wilt werken.\r\nIn de in Power Query Editor geopende query klik je met de\r\nrechtermuisknop op een kolomkop en kies je vervolgens Type\r\nwijzigen > Op basis van landinstellingen-id.\r\n\r\nIn het dan verschijnende dialoogvenster selecteer je de gewenste\r\nlandinstellingen.\r\n\r\nSamenvatting\r\nDe landinstellingen voor het besturingssysteem wijzigen is aan te\r\nbevelen wanneer je meestal de bestanden uit een specifiek land\r\nimporteert en je ook wilt dat ze in de opmaak van dat land in het Excel\r\nwerkblad verschijnen. Deze landinstellingen gelden voor alle programma’s\r\nop jouw computer.\r\nDe landinstellingen wijzigen via Queryopties is in de meeste\r\ngevallen de aan te bevelen methode. Deze landinstellingen gelden voor\r\nalle query’s in de werkmap.\r\nDe landinstellingen wijzigen via gegevenstype in de Query Editor\r\ngebruik je wanneer je met meerdere landinstellingen in een of meerdere\r\nquery’s in dezelfde werkmap werkt. De landinstellingen gelden alleen\r\nvoor de geselecteerde kolom in de query.\r\nExperimenteren\r\nIk heb twee kleine gegevensbestanden gemaakt om mee te\r\nexperimenteren. Deze bevatten dezelfde gegevens, maar verschillen in\r\nopmaak voor de variabelen datum en prijs en in\r\nhet lijstscheidingsteken.\r\nbrandstofprijzen-nl.csv -\r\nOpmaak Nederland.\r\nbrandstofprijzen-en.csv -\r\nOpmaak Verenigde Staten.\r\n\r\n\r\n\r\n",
    "preview": "posts/2022-03-14-powerquery-en-landinstellingen/query-opties-werkmap.png",
    "last_modified": "2022-06-08T09:58:28+02:00",
    "input_file": {},
    "preview_width": 512,
    "preview_height": 357
  },
  {
    "path": "posts/2022-03-01-complexe-getallen-in-excel/",
    "title": "Complexe getallen in Excel",
    "description": "Excel functies voor het werken met complexe getallen.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2022-03-01",
    "categories": [
      "excel"
    ],
    "contents": "\r\nComplex getal\r\nEen complex getal wordt vaak voorgesteld door de letter \\(z\\) en weergegeven op twee manieren:\r\n\\(z = x +iy = \\rho(cos \\phi + i sin\r\n\\phi)\\)\r\nHierin zijn \\(x\\), \\(y\\), \\(\\rho\\) en \\(\\phi\\) reële getallen en wordt \\(i\\) de imaginaire eenheid genoemd\r\nmet als eigenschap \\(i^2 = -1\\).\r\n\\(x\\) : Reële deel van\r\n\\(z\\)\r\n\\(y\\) : Imaginaire deel\r\nvan \\(z\\)\r\n\\(\\rho\\): Modulus van\r\n\\(z\\) (de absolute waarde)\r\n\\(\\phi\\): Argument van\r\n\\(z\\)\r\nDe relaties tussen deze vier getallen zijn\r\n\\(\\rho = \\sqrt{x^2 + y^2}\\), \\(\\cos \\phi = \\frac{x}{\\rho}\\), \\(\\sin\\phi = \\frac{y}{\\rho}\\)\r\n\r\n\r\nknitr::include_graphics(\"complex-getal.png\")\r\n\r\n\r\n\r\n\r\nExcel\r\nJe kunt in Excel met complexe getallen werken, maar niet op dezelfde\r\nmanier als met reële getallen.\r\nOm te beginnen moet je een complex getal invoeren met de functie\r\nCOMPLEX\r\nSyntax:\r\nCOMPLEX(reëel_deel;imaginair_deel;[achtervoegsel])\r\nreëel_deel: De reële coëfficiënt van het complexe\r\ngetal. Vereist.\r\nimaginair_deel: De imaginaire coëfficiënt van het\r\ncomplexe getal. Vereist.\r\nachtervoegsel : Symbool voor de imaginaire eenheid\r\n(defaultwaarde “i”). Optioneel. Voor wanneer je bijvoorbeeld \\(j\\) als symbool wilt gebruiken.\r\nWanneer je in een cel de formule =COMPLEX(3;4) invoert,\r\ndan is de de uitvoer 3+4i\r\nWanneer je rekenkundige bewerkingen met complexe getallen wilt\r\nuitvoeren dan kun je dat niet met de normale symbolen doen. Wil je\r\nbijvoorbeeld de complexe getallen \\(3\r\n+4i\\) en \\(7 - 2i\\) bij elkaar\r\noptellen, dan kan dat niet met de formule\r\n=COMPLEX(3;4) + COMPLEX(7;-2), dat geeft als uitvoer\r\n#WAARDE!.\r\nVoor het werken met complexe getallen zijn speciale functies\r\nbeschikbaar die in de Engelstalige versie met IM beginnen\r\nen in de Nederlandstalige versie met C.. In de tabel hierna\r\nstaan een aantal veel gebruikte functies.\r\nEN\r\nNL\r\nBetekenis\r\nIMSUM\r\nC.SOM\r\nOptellen\r\nIMSUB\r\nC.VERSCHIL\r\nAftrekken\r\nIMPRODUCT\r\nC.PRODUCT\r\nVermenigvuldigen\r\nIMDIV\r\nC.QUOTIENT\r\nDelen\r\nIMABS\r\nC.ABS\r\nAbsolute waarde\r\nIMARGUMENT\r\nC.ARGUMENT\r\nArgument\r\nIMCONJUGATE\r\nC.TOEGEVOEGD\r\nToegevoegd complex\r\nIMREAL\r\nC.REEEL.DEEL\r\nReële deel\r\nIMAGINARY\r\nC.IM.DEEL\r\nImaginair deel\r\nIMABS\r\nC.ABS\r\nModulus\r\nIMARGUMENT\r\nC.ARGUMENT\r\nArgument\r\n\r\n\r\n\r\n",
    "preview": "posts/2022-03-01-complexe-getallen-in-excel/complex-getal.png",
    "last_modified": "2022-06-08T09:59:06+02:00",
    "input_file": {},
    "preview_width": 180,
    "preview_height": 237
  },
  {
    "path": "posts/2022-02-22-converteren/",
    "title": "Converteren van eenheden",
    "description": "Met de Excel formule CONVERTEREN kun je eenvoudig Engelstalige eenheden omrekenen naar andere eenheden.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2022-02-22",
    "categories": [
      "excel"
    ],
    "contents": "\r\nBij mijn hobby bierbrouwen put ik regelmatig uit Amerikaanse boeken\r\nen artikelen. De daar gehanteerde eenheden als pounds, gallons,\r\nFahrenheit moet ik dan omrekenen naar in dit geval kilogram, liter en\r\nCelsius. Erg handig daarbij is de Excel functie\r\nCONVERTEREN(). Met deze ingebouwde functie kun je een\r\nmaateenheid omzetten naar een andere maateenheid van dezelfde soort. Dus\r\neenheid van massa naar een andere eenheid van massa, of een eeheid van\r\nvolume naar een andere eenheid van volume.\r\nSyntax: CONVERTEREN(getal; van_eenheid; naar_eenheid)\r\ngetal: de waarde (of celverwijzing) die je wilt\r\nconverteren.\r\nvan_eenheid: de huidige eenheid.\r\nnaar_eenheid: de gewenste eenheid.\r\nVoor de eenheden moet je specifieke tekstwaarden (dus tussen dubbele\r\naanhalingstekens) gebruiken. Een overzicht van de toegestane\r\ntekstwaarden kun je vinden op Microsoft\r\nsupport. let er op dat deze tekstwaarden hoofdlettergevoelig\r\nEenvoudige conversies\r\nIn de volgende afbeelding zie je een voorbeeld van een paar\r\neenvoudige conversies, waarbij steeds één eenheid wordt omgezet naar één\r\nandere eenheid.\r\nEenvoudige conversiesDe functie kun je ook tot een macht verheffen. Zo kun je 10 square\r\nfeet omzetten naar vierkante meters met de formule\r\n=CONVERTEREN(10; \"ft\"; \"m\")^2.\r\nMetrische eenheden kunnen voorafgegaan worden door een\r\nprefix die de waarde met een macht van 10 vermenigvuldigt. In\r\nde tabel hierna zie je een aantal veel gebruikte waarden.\r\nPrefix\r\nWaarde\r\nAfkorting\r\nPrefix\r\nWaarde\r\nAfkorting\r\ntera\r\n1012\r\n“T”\r\ndeci\r\n10-1\r\n“d”\r\ngiga\r\n109\r\n“G”\r\ncenti\r\n10-2\r\n“c”\r\nmega\r\n106\r\n“M”\r\nmilli\r\n10-3\r\n“m”\r\nkilo\r\n103\r\n“k”\r\nmicro\r\n10-6\r\n“u”\r\nhecto\r\n102\r\n“h”\r\nnano\r\n10-9\r\n“n”\r\ndeca\r\n10\r\n“e”\r\npico\r\n10-12\r\n“p”\r\n4000 meter omrekenen naar kilometer:\r\n=CONVERTEREN(4000;\"m\";\"km\")\r\n0,5 liter omrekenen naar milliliter:\r\n=CONVERTEREN(0,5;\"l\";\"ml\")\r\nComplexere conversies\r\nEen mooi voorbeeld van een wat complexere omzetting heb je bij\r\neenheden voor druk, de kracht per oppervlakte. Deze wordt berekend met\r\nde formule \\(p = \\frac{F}{A}\\), waarbij\r\n\\(F\\) staat voor de kracht (Force) en\r\n\\(A\\) voor de oppervlakte (Area). In\r\nhet SI stelsel is\r\nde eenheid van druk de pascal, met 1 Pa = 1 N/m^2^. In de\r\nVS is de psi (pounds per square inch) gebruikelijk.\r\nOm 1 psi om te zetten naar N/m2 moet je dus de\r\n(kracht)pounds omzetten naar Newton en de square inch naar vierkante\r\nmeter. Dat kan met de formule=CONVERTEREN(1;\"lbf\";\"N\")/CONVERTEREN(1;\"in\";\"m\")^2.\r\nIn plaats van een deling kun je er ook een vermenigvuldiging van maken\r\ndoor in de laatste formule de eenheden te verwisselen. De formule wordt\r\ndan=CONVERTEREN(1;\"lbf\";\"N\")*CONVERTEREN(1;\"m\";\"in\")^2.\r\nGelukkig bestaat er ook een rechtstreekse omzetting van psi naar\r\npascal met =CONVERTEREN(1;\"psi\";\"Pa\") of naar kilo Pascal\r\nmet=CONVERTEREN(1;\"psi\";\"kPa\").\r\n\r\n\r\n\r\n",
    "preview": "posts/2022-02-22-converteren/logo.jpg",
    "last_modified": "2022-06-08T09:59:41+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-01-28-kwartaal-uit-datum/",
    "title": "Kwartaal uit datum",
    "description": "Formules om het kwartaalnummer uit een datum te halen.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2022-01-28",
    "categories": [
      "excel"
    ],
    "contents": "\r\nMet de functies JAAR(), MAAND() en\r\nDAG() kun je jaar, maand en dag uit een datum halen. Nu\r\nmoet ik bij analyses van tijdreeksen nogal eens weten in welk kwartaal\r\neen datum valt. Helaas heeft Excel hiervoor geen functie, maar met een\r\nformule is dat eenvoudig te doen. Zie de twee soorten formules in het\r\nvolgende voorbeeld.\r\n\r\nWeliswaar zien de formules er verschillend uit, maar het principe is\r\nhetzelfde.\r\nBij de formule in kolom C wordt eerst het maandnummer bepaald, welke\r\ndan door 3 gedeeld wordt om vervolgens de uitkomst naar boven af te\r\nronden.\r\nBij de formule in kolom E wordt ook eerst het maandnummer bepaald,\r\nwaar dan 2 bij opgeteld wordt, dan wordt deze uitkomst door 3 gedeeld om\r\nvervolgens het getal voor de komma te nemen.\r\nHet is dan ook niet zo moeilijk meer om met een van beide formules\r\nconstructies te maken als in de volgende figuur:\r\n\r\nBij gebruik van draaitabellen kan Excel zelf tijdgerelateerde velden\r\nautomatisch uit een datum halen. Zie in mijn studieboek het voorbeeld Groeperen\r\nvan gegevens.\r\n\r\n\r\n\r\n",
    "preview": "posts/2022-01-28-kwartaal-uit-datum/kwartalen.png",
    "last_modified": "2022-06-08T10:00:07+02:00",
    "input_file": {},
    "preview_width": 250,
    "preview_height": 282
  },
  {
    "path": "posts/2021-05-21-matrixbewerkingen-in-excel/",
    "title": "Matrixbewerkingen in Excel",
    "description": "Het werken met matrices (arrays) in Excel.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2021-05-21",
    "categories": [
      "excel",
      "matrix"
    ],
    "contents": "\r\n\r\nContents\r\nWat is een matrix in Excel?\r\nDynamisch\r\ngedrag\r\n\r\nWiskundige bewerkingen\r\nScalaire bewerkingen\r\nOptellen en aftrekken van\r\nmatrices\r\nVermenigvuldigen van\r\nmatrices\r\n\r\nGetransponeerde matrix\r\nEenheidsmatrix\r\nDeterminant\r\nInverse\r\nmatrix\r\nStelsel vergelijkingen\r\noplossen\r\n\r\nWat is een matrix in Excel?\r\nEen vector is een lijstje met getallen die of in een rij of in een\r\nkolom staan. Je hebt dan respectievelijke een rijvector of een\r\nkolomvector. Excel gebruikt niet de term vector, maar matrix\r\n(Engelstalig: Array). Een matrix in Excel kan zijn:\r\n1-dimensionaal horizontaal\r\nEen rij met waarden (eigenlijk een rijvector).\r\n\r\n\r\n\r\nFigure 1: Horizontale matrix\r\n\r\n\r\n\r\n1-dimensionaal verticaal\r\nEen kolom met waarden (eigenlijk een kolomvector).\r\n\r\n\r\n\r\nFigure 2: Verticale matrix\r\n\r\n\r\n\r\n2-dimensionaal\r\nEen rechthoek van rijen en kolommen met waarden, een gebied dus.\r\n\r\n\r\n\r\nFigure 3: Rechhoekige matrix\r\n\r\n\r\n\r\nInvoeren van een matrix\r\nEen matrix met constante waarden zoals in de getoonde drie\r\nvoorbeelden maak je door in een cel te beginnen met het =\r\nsymbool en dan een rijtje waarden tussen accolades { } te\r\nplaatsen. De waarden moeten van elkaar gescheiden worden door een\r\nspeciaal symbool. Welke symbolen je moet gebruiken als scheidingssymbool\r\nhangt af van de taal- en landinstellingen op de computer.\r\nTable 1:  Symbolen voor scheiding van rijen en\r\nkolommen.\r\nTaalinstelling\r\nKolom\r\nRij\r\nNederlands\r\n\\\r\n;\r\nEngels\r\n,\r\n;\r\nVerder moet een matrix invoeren in volgorde van rijen (dus rij voor\r\nrij) en alle rijen moeten evenveel kolommen hebben.\r\nDe drie voorbeelden hiervoor zijn als volgt in Excel ingevoerd.\r\n={1\\2\\3\\4\\5} geeft 1 rij met 5 kolommen.\r\n={1;3;6} geeft 3 rijen met 1 kolom.\r\n={1\\2\\3\\4\\5;3\\5\\7\\9\\11;6\\9\\12\\15\\18} geeft 3 rijen met\r\n5 kolommen.\r\nLet op:\r\nVoor alle voorbeelden geldt dat alleen de eerste cel bewerkbaar is.\r\nDat is de cel waar de matrix is ingevoerd. Wanneer je een andere cel in\r\nhet waardengebied selecteert, dan is de inhoud in de formulebalk grijs\r\ngekleurd en kun je de waarde niet wijzigen.\r\nDynamisch gedrag\r\nIn Excel 365 zijn de matrices dynamisch.\r\nEen matrixformule die in één cel op het werkblad wordt ingevoerd kan\r\nresultaten in meerdere cellen op het werkblad plaatsen. Dit gedrag wordt\r\noverlopen (Engels: spilling) genoemd en de\r\nresultaten verschijnen in een overloopgebied\r\n(spill-range). Welke en hoeveel cellen gebruikt worden hangt\r\nvan het resultaat van de formule af. Als de broninhoud van de formule\r\nverandert worden de resultaten dynamisch bijgewerkt en kan het zijn dat\r\nhet overloopgebied groeit of krimpt. Je krijgt een foutmelding\r\n#OVERLOOP! wanneer het overlopen geblokkeerd wordt doordat\r\ncellen van het overloopgebied al een inhoud hebben.\r\nVerwijzing naar overloopgebied\r\nOm een verwijzing naar een overloopgebied te maken zet je een hash\r\nsymbool # achter het adres van de eerste cel van het\r\noverloopgebied. Is bijvoorbeeld het overloopgebied J2:N4, dan verwijs je\r\nhiernaar met =J2#.\r\nJe kunt deze verwijzing ook in een formule opnemen. Zo geeft\r\nbijvoorbeeld =AANTAL(J2#) als antwoord 15, het aantal\r\ncellen in dit gebied. Wanneer later de grootte van het overloopgebied\r\nverandert, dan verandert ook het resultaat van de formule.\r\nNaamgeving matrix\r\nWanneer je met matrices gaat rekenen, is het erg handig om deze van\r\neen naam te voorzien. Dat kan op dezelfde manier als het toekennen van\r\neen naam aan een cel. In de formules kun je dan met de naam van de\r\nmatrix werken.\r\nWiskundige bewerkingen\r\nScalaire bewerkingen\r\nBij een matrix kan een scalair (dit is één getal) opgeteld\r\nof afgetrokken worden. En ook kun je een matrix met een scalair\r\nvermenigvuldigen of daardoor delen. In alle gevallen wordt de bewerking\r\nop de afzonderlijke elementen van de matrix toegepast. Het resultaat is\r\neen matrix van dezelfde afmetingen.\r\n\r\n\r\n\r\nFigure 4: Scalaire bewerkingen uitgevoerd op een matrix. Het\r\nscalaire getal staat steeds in kolom E.\r\n\r\n\r\n\r\n\r\nA1:={1\\2\\3;3\\5\\7;6\\9\\12} A7, A12, A17:=A2#\r\nG2:=A2# + E2\r\nG7:=A7# - E7\r\nG12:=A12# * E12\r\nG17:=A17# / E17\r\nOptellen en aftrekken van\r\nmatrices\r\nMatrices met dezelfde afmetingen kunnen opgeteld of afgetrokken\r\nworden. De overeenkomstige elementen worden dan opgeteld of afgetrokken.\r\nHet resultaat is een matrix van dezelfde afmetingen.\r\n\r\n\r\n\r\nFigure 5: Optellen en aftrekken van Twee matrices\r\n\r\n\r\n\r\n\r\nA1:={5\\7;8\\4;3\\2}\r\nD1:={3\\1;9\\6;8\\3}\r\nG1:=A1# + D1#\r\nA6:=A1#\r\nD6:=D1#\r\nG6:=A6# + D6#\r\nOpmerking: In plaats van eerst de matrices in afzonderlijke cellen in\r\nte voeren kun je deze ook in de formule opnemen, bijvoorbeeld\r\n={5\\7;8\\4;3\\2} + {3\\1;9\\6;8\\3}.\r\nVermenigvuldigen van\r\nmatrices\r\nTwee matrices kunnen vermenigvuldigd worden wanneer ze passende\r\nafmetingen hebben. Dat is het geval wanneer het aantal kolommen in de\r\neerste matrix gelijk is aan het aantal rijen van de tweede matrix. Het\r\nresultaat is een matrix met het aantal rijen van de eerste matrix en het\r\naantal kolommen van de tweede matrix. Dus een \\(m \\times n\\) matrix kun je vermenigvuldigen\r\nmet een \\(n \\times o\\) matrix en het\r\nresultaat is een \\(m \\times o\\)\r\nmatrix.\r\nEr vindt een rij x kolom vermenigvuldiging plaats. Als demonstratie\r\nvan hoe dit in zijn werk gaat wordt in het volgende voorbeeld een \\(3 \\times 2\\) matrix vermenigvuldigd met een\r\n\\(2 \\times 3\\) matrix met als resultaat\r\neen \\(3 \\times 3\\) matrix.\r\n\\[\\left[ {\\begin{array}{*{20}{c}}\r\n1&2\\\\\r\n3&4\\\\\r\n5&6\r\n\\end{array}} \\right] \\times \\left[ {\\begin{array}{*{20}{c}}\r\n1&2&3\\\\\r\n4&5&6\r\n\\end{array}} \\right] = \\left[ {\\begin{array}{*{20}{c}}\r\n{1 \\times 1 + 2 \\times 4}&{1 \\times 2 + 2 \\times 5}&{1 \\times 3\r\n+ 2 \\times 6}\\\\\r\n{3 \\times 1 + 4 \\times 4}&{3 \\times 2 + 4 \\times 5}&{3 \\times 3\r\n+ 4 \\times 6}\\\\\r\n{5 \\times 1 + 6 \\times 4}&{5 \\times 2 + 6 \\times 5}&{5 \\times 3\r\n+ 6 \\times 6}\r\n\\end{array}} \\right] = \\left[ {\\begin{array}{*{20}{c}}\r\n9&{12}&{15}\\\\\r\n{19}&{26}&{33}\\\\\r\n{29}&{40}&{51}\r\n\\end{array}} \\right]\\]\r\nFormule Excel: PRODUCTMAT(matrix1;matrix2)\r\n\r\n\r\n\r\nFigure 6: Vermenigvuldiging van twee matrices\r\n\r\n\r\n\r\n\r\nA2:={1\\2;3\\4;5\\6}\r\nD2:={1\\2\\3;4\\5\\6}\r\nH2:=PRODUCTMAT(A2#;D2#)\r\nGetransponeerde matrix\r\nDe getransponeerde van matrix \\(A\\)\r\nwordt meestal aangeduid met \\(A^T\\). Om\r\neen matrix te transponeren verwissel je de rijen en de kolommen. Dus de\r\nrijen van \\(A\\) worden de kolommen van\r\n\\(A^T\\). Heeft \\(A\\) de afmetingen \\(m \\times n\\), dan heeft \\(A^T\\) de afmetingen \\(n \\times m\\). Een voorbeeld.\r\nAls \\(A = \\left[ \\begin{matrix} 1 & 2\r\n\\\\ 3 & 4 \\\\ 5 & 6 \\end{matrix} \\right]\\), dan is \\(A^T = \\left[ \\begin{matrix} 1 & 3 & 5 \\\\ 2\r\n& 4 & 6 \\end{matrix} \\right]\\)\r\nFormule Excel: TRANSPONEREN()\r\n\r\n\r\n\r\nFigure 7: Transponeren van een matrix\r\n\r\n\r\n\r\n\r\nA2:={1\\2;3\\4;5\\6}\r\nD2:=TRANSPONEREN(A2#)\r\nEenheidsmatrix\r\nEen eenheidsmatrix, ook wel identiteitsmatrix genoemd, is een\r\nvierkante matrix, waarvan de hoofddiagonaal (van linksboven\r\nnaar rechtsonder) uitsluitend uit enen bestaat en alle andere elementen\r\nnul zijn. Een eenheidsmatrix wordt meestal aangeduid met \\(I\\).\r\nEen eenheidsmatrix kun je in Excel genereren met de functie\r\nEENHEIDMAT(n) waarbij n de afmeting (dimensie) is.\r\n\r\n\r\n\r\nFigure 8: Voorbeeld van een eenheidsmatrix 5x5.\r\n\r\n\r\n\r\n\r\nA1:=EENHEIDMAT(5)\r\nGa na dat \\(I^T = I\\)\r\nDeterminant\r\nDe determinant van een vierkante matrix is een speciaal\r\ngetal dat uit de elementen van die matrix berekend kan worden. De\r\ndeterminant van matrix \\(A\\) wordt\r\nmeestal aangeduid met \\(|A|\\) en soms\r\nook wel met \\(det(A)\\). De determinant\r\nwordt vaak gebruikt bij het oplossen van stelsels vergelijkingen met\r\nmeerdere variabelen.\r\nBerekening determinant voor een \\(2\r\n\\times 2\\) matrix\r\n\\(\\begin{vmatrix} a & b \\\\ c & d\r\n\\end{vmatrix} = ad - bc\\)\r\nEen voorbeeld met getallen:\r\n\\(\\begin{vmatrix} 5 & 8 \\\\ 7 & 12\r\n\\end{vmatrix} = 5 \\times 12 - 8 \\times 7 = 60 -56 = 4\\)\r\nBerekening determinant voor een \\(3\r\n\\times 3\\) matrix\r\n\\(\\begin{vmatrix} a & b & c \\\\ d\r\n& e & f \\\\ g & h & i \\end{vmatrix} = a\\begin{vmatrix} e\r\n& f \\\\ h & i \\end{vmatrix} - b\\begin{vmatrix} d & f \\\\ g\r\n& i \\end{vmatrix} + c\\begin{vmatrix} d & e \\\\ g & h\r\n\\end{vmatrix}\\)\r\nEen voorbeeld met getallen:\r\n\\(\\begin{vmatrix} 1 & 4 & 3 \\\\ 5\r\n& 2 & 7 \\\\ 8 & 6 & 12 \\end{vmatrix} = 1\\begin{vmatrix} 2\r\n& 7 \\\\ 6 & 12 \\end{vmatrix} - 4\\begin{vmatrix} 5 & 7 \\\\ 8\r\n& 12 \\end{vmatrix} + 3\\begin{vmatrix} 5 & 2 \\\\ 8 & 6\r\n\\end{vmatrix} = \\\\ 1(24-42) -4(60-56) + 3(30-16) = 18 -16 + 42 =\r\n8\\)\r\nFormule Excel: DETERMINANTMAT()\r\n\r\n\r\n\r\nFigure 9: Voorbeelden van de berekening van de determinant\r\n\r\n\r\n\r\n\r\nE1:=DETERMINANTMAT(A1#)\r\nE5:=DETERMINANTMAT(A5#)\r\nGa na dat de determinant van een eenheidsmatrix gelijk is aan 1.\r\nDeze procedure kan recursief worden toegepast voor de determinant van\r\neen \\(n \\times n\\) matrix en staat\r\nbekend als de Laplace-expansie.\r\nInverse matrix\r\nDe inverse van een matrix \\(A\\)\r\nwordt aangeduid met \\(A^{-1}\\). Bij\r\nvermenigvuldiging van een matrix met zijn inverse krijg je je de\r\neenheidsmatrix \\(I\\):\r\n\\(A \\cdot A^{-1} = I\\).\r\nAlleen vierkante matrices, maar niet alle, kunnen geinverteerd\r\nworden. Een vierkante matrix kan alleen geinverteerd worden wanneer\r\nde determinant ongelijk aan nul is. Als de inverse bestaat heet de\r\nmatrix inverteerbaar. Het inverteren van een matrix is vaak\r\nzeer bewerkelijk. Net als de determinant wordt de inverse gebruikt bij\r\nhet oplossen van stelsels vergelijkingen met meerdere variabelen.\r\nFormule Excel: INVERSEMAT()\r\n\r\n\r\n\r\nFigure 10: Het inverteren van een matrix.\r\n\r\n\r\n\r\n\r\nA2:={1\\-1;4\\6}\r\nA6:=DETERMINANTMAT(A2#) D2:=INVERSEMAT(A2#)\r\nG2:=PRODUCTMAT(A2#;D2#)\r\nIn A2 is matrix \\(A\\) ingevoerd. In\r\nA6 is met de formule =DETERMINANTMAT(A2#) de determinant\r\nvan A, \\(|A|\\), berekend, welke gelijk\r\naan 10 is. Dus niet nul, dus matrix A is inverteerbaar. In D2 is de\r\n\\(A^{-1}\\) berekend met de formule\r\n=INVERSEMAT(A2#). In G2 is matrixproduct \\(A A^{-1}\\) berekend, welke gelijk is aan de\r\neenheidsmatrix. De berekende waarde in H2 is zo goed als gelijk aan\r\n\\(0\\).\r\nStelsel vergelijkingen\r\noplossen\r\nEen stelsel van drie vergelijkingen met drie variabelen:\r\n\\[\\begin{array}{lclclcl}\r\n5x &+& 1y &+& 8z &=& 46 \\\\\r\n4x &-& 2y &&     &=& 12 \\\\\r\n6x &+& 7y &+& 4z &=& 50\r\n\\end{array}\\]\r\nIn matrixnotatie kan dit geschreven worden als \\(AX = B\\)\r\nmet \\(A = \\left[ \\begin{matrix} 5 & 1\r\n& 8 \\\\ 4 & -2 & 0 \\\\ 6 & 7 & 4 \\end{matrix}\r\n\\right]\\), \\(X = \\left[ \\begin{matrix}\r\nx \\\\ y \\\\ z \\end{matrix} \\right]\\) en \\(B = \\left[ \\begin{matrix} 46 \\\\ 12 \\\\ 50\r\n\\end{matrix} \\right]\\)\r\nEerst in het kort de wiskundige achtergrond. Wanneer de inverse \\(A^{-1}\\) bestaat, dan kun je beide kanten\r\nvan de vergelijking hiermee vermenigvuldigen:\r\n\\(A^{-1}AX = A^{-1}B\\)\r\nOmdat \\(A^{-1}A\\) gelijk is aan de\r\neenheidsmatrix kan dit herschreven worden als \\(X = A^{-1}B\\). Je kunt dus \\(X\\) bepalen door het matrix product van\r\n\\(A^{-1}\\) en \\(B\\) te berekenen.\r\nUitvoering in Excel\r\n\r\n\r\n\r\nFigure 11: Het oplossen van een stelsel van drie\r\nvergelijkingen met drie onkende variabelen\r\n\r\n\r\n\r\n\r\nB1:={5\\1\\8;4\\-2\\0;6\\7\\4}\r\nG1:={46;12;50}\r\nB5:=DETERMINANTMAT(B1#)\r\nB7:=INVERSEMAT(B1#)\r\nG7:=PRODUCTMAT(B7#;G1#)\r\nDe formule voor matrix \\(A\\) en\r\n\\(B\\) staan in respectievelijk cel B1\r\nen cel G1. Om te controleren of de inverse van \\(A\\) bestaat moet de determinant \\(|A|\\) berekend worden. Dat is gedaan in cel\r\nB5 en deze is 264. De inverse bestaat dus en is vervolgens berekend in\r\ncel B7. Tot slot kan het matrixproduct \\(A^{-1}B\\) in cel G7 bepaald worden.\r\nDe oplossing van het stelsel vergelijkingen is dus \\(x=4\\), \\(y=2\\) en \\(z=3\\).\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-05-21-matrixbewerkingen-in-excel/vergelijkingen.png",
    "last_modified": "2022-06-08T10:00:48+02:00",
    "input_file": {},
    "preview_width": 422,
    "preview_height": 177
  },
  {
    "path": "posts/2021-04-14-workflow-studieboeken/",
    "title": "Workflow studieboeken",
    "description": "Uitleg over de workflow voor de productie van mijn studieboeken.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2021-04-14",
    "categories": [
      "eboek"
    ],
    "contents": "\r\n\r\nContents\r\nOverzicht\r\nOpmaaktaal brondocumenten\r\nVersiebeheer\r\nPubliceren\r\nSamenvatting workflow\r\nGebruikte\r\nsoftware\r\n\r\nMarkdown\r\nR Markdown\r\nR\r\nR + Markdown\r\n\r\nGit\r\nNieuwe\r\nrepository\r\nKloon\r\neen repository\r\nBranches\r\n\r\nGitHub\r\nNetlify\r\nSamenwerking\r\n\r\nEerst een kort overzicht over de gehele workflow rond de\r\ncursusboeken. Daarna wordt op de belangrijkste onderdelen wat meer in\r\ndetail ingegaan.\r\nOverzicht\r\nOpmaaktaal brondocumenten\r\nWat de brondocumenten betreft zijn mijn cursusboeken in twee soorten\r\nte onderscheiden\r\nVoor de oudere Engelstalige cursusboeken is de opmaak DITA, een XML variant. Voor de\r\nproductie gebruik ik Oxygen XML\r\nEditor, zowel als editor voor de brondocumenten als voor het\r\npubliceren in HTML, PDF en EPUB formaat.\r\nDe Nederlandstalige cursusboeken zijn geschreven in de taal\r\nR Markdown. Dit is platte Markdown tekst met\r\naf en toe R-code voor het genereren van sommige grafieken en\r\ndiagrammen. Markdown is een erg eenvoudige opmaaktaal\r\nen R is een (gratis) programmeertaal voor statistische\r\nberekeningen en grafieken.\r\nHet vervolg van dit document heeft voornamelijk betrekking op de\r\nnieuwe cursusboeken.\r\nVersiebeheer\r\nHet bijhouden van alle fases van de cursusboeken wordt met\r\nversiebeheer gedaan. Het gebruikte versiebeheersysteem is\r\nGit, open source en gratis. Dit is lokaal op mijn\r\ncomputers geïnstalleerd. Elk cursusboek is georganiseerd in een\r\nproject (= een map/directory), dat in versiebeheer ook wel een\r\nrepository genoemd wordt. De actieve projectmappen, dat zijn\r\ndie waarin gewerkt wordt, staan op mijn lokale PC. Verder staan alle\r\nrepositories, zowel de actieve als de inactieve, ook op een NAS\r\n(netwerkschijf). Daarnaast staan de repositories van de cursusboeken ook\r\nop GitHub, een online platform (cloud), voor iedereen\r\ntoegankelijk.\r\nPubliceren\r\nUit de brondocumenten wordt een publicatie gemaakt, meestal in een\r\nvan de volgende eindformaten: HTML (voor online gebruik), PDF of EPUB.\r\nHiervoor wordt RStudio Desktop gebruikt. De HTML onlineversie is in\r\nfeite een statische website, een map met inhoud, zonder gebruik van een\r\ndatabase en kan op elke webserver geplaatst worden.\r\nOp de lokale computer kun je de onlineversie aanmaken en vervolgens\r\nvia FTP de outputmap uploaden naar de webserver.\r\nDe hosting van de cursusboeken is ondergebracht bij\r\nNetlify, een bedrijf voor o.a webhosting, maar eentje\r\ndie integratie met GitHub aanbiedt. Bij wijzigingen in\r\nde repository kan de website automatisch bijgewerkt worden. Voor\r\npersoonlijk gebruik is Netlify gratis met een totaal gebruik van\r\n100GB/maand. Upgraden kan, maar daar hangt een prijskaartje aan. Het\r\ngebruik wordt gemonitord met Google Analytics.\r\nSamenvatting workflow\r\nEr wordt lokaal eenmalig een projectmap aangemaakt en hierin Git\r\nversiebeheer geactiveerd waardoor het een Git repository wordt.\r\nEr wordt op GitHub (en op de lokale NAS) een speciale kopie (een\r\nremote repository) gemaakt van de lokale repository.\r\nMet RStudio Desktop worden de Markdown en RMarkdown documenten\r\ngemaakt en bijgewerkt.\r\nNa wijzigingen wordt de repository bijgewerkt en gesynchroniseerd\r\nmet de repository op de NAS en GitHub.\r\nDe onlineversie wordt via Netlify gepubliceerd.\r\nGebruikte software\r\nGit\r\nR\r\nRStudio\r\nDesktop.\r\nGitHub\r\nNetlify\r\nMarkdown\r\nMarkdown is een erg eenvoudige opmaaktaal, zie Wikipedia. Het aantal\r\ntags is beperkt. De bestandsextensie is .md. Wanneer je een\r\nlokaal bestand met een browser opent zie je alleen de platte tekst.\r\nApplicaties kunnen een .md bestand omzetten naar HTML.\r\nWanneer je op GitHub een .md bestand met de browser open\r\ndan wordt deze automatisch omgezet naar HTML.\r\nHet werken ermee is laagdrempelig. Het schrijven kan met een\r\nkladblokprogramma, je ziet dan weliswaar de opmaak in HTML formaat niet.\r\nDat kan wel met een van de vele gratis Markdown\r\neditors of met Microsoft’s Visual Studio Code. Zelf gebruik ik\r\nRStudio Desktop. Ook zijn er addons voor browsers.\r\nR Markdown\r\nEerst iets over R zelf..\r\nR\r\nR is een (gratis) programmeertaal voor statistische berekeningen en\r\ngrafieken en beschikbaar voor Windows, MacOS en Unix/Linux. Bij de\r\ninstallatie zit een eenvoudige GUI en een console. Via de console kun je\r\nR opdrachten intypen en direct laten uitvoeren. Via de Gui kun je een\r\nbestand met R opdrachten maken (R-script), opslaan en uitvoeren.\r\nHieronder een eenvoudig voorbeeld met vier opdrachten. Eerst worden\r\n1000 getallen random getrokken uit een normale verdeling met gemiddelde\r\n6,5 en een standaarddeviatie 1,5. Het resultaat wordt toegekend aan\r\nvariabele z. In R is dat een vector met in dit geval 1000\r\ngetallen. De opdracht summary geeft een\r\n5-getallensamenvatting van de waarden, waarna een histogram en een\r\nboxplot wordt getekend.\r\n\r\n\r\nset.seed(123)\r\nz <- rnorm(n = 1000, mean = 6.5, sd = 1.5)\r\nsummary(z)\r\n\r\n\r\n   Min. 1st Qu.  Median    Mean 3rd Qu.    Max. \r\n  2.285   5.558   6.514   6.524   7.497  11.362 \r\n\r\nhist(z)\r\n\r\n\r\n\r\nboxplot(z)\r\n\r\n\r\n\r\n\r\nJe kunt met de standaard meegeleverde Gui werken, maar veel\r\nplezieriger en handiger is het om met RStudio Desktop\r\nte werken. Dat is een super IDE van de firma RStudio die als gratis open\r\nsource editie beschikbaar is. Wanneer je met R werkt kun je eigenlijk\r\nniet zonder. Tot zover R zelf.\r\nR + Markdown\r\nEen R Markdown bestand (extensie .Rmd) is een Markdown\r\nbestand waarin je ook R code kunt opnemen. Hieruit kan dan een document\r\ngeproduceerd worden dat naast de opgemaakte markdown tekst ook de\r\nuitvoer van de R-code bevat, bijvoorbeeld een grafiek. Hierdoor is het\r\noverbodig geworden om deze eerst apart in een programma (R, Excel, …) R\r\n(of Excel) taan te maken om ze daarna samen te voegen met de\r\nteksten.\r\nRStudio heeft hier hulpmiddelen omheen gebouwd om de uitvoer in\r\nverschillende formaten te produceren, zoals HTML, PDF, EPUB, Word, …\r\nHierdoor heb je de mogelijkheid om jouw analyses om te zetten in\r\nkwalitatief hoogwaardige rapporten, presentaties, dashboards,\r\ntijdschriftartikelen, … Zo is ook de bron van dit document een\r\n.Rmd bestand.\r\nJe hoeft niet perse R-code op te nemen. Het kan ook zonder en alleen\r\nMarkdown tekst bevatten. Je blijft dan het voordeel houden dat je van de\r\nfantastische uitvoermogelijkheden gebruik kunt maken. Voor de\r\ncursusboeken is geen R-code nodig. Toch gebruik ik soms R-code om\r\ndynamisch grafieken, tabellen en diagrammen te maken.\r\nGit\r\nVersiebeheer is een systeem waarin je veranderingen van bestanden in\r\neen werkmap bijhoudt. Je kunt hierdoor steeds zien welke veranderingen\r\ner in welke bestanden zijn geweest en door wie die zijn aangebracht. Je\r\nkunt ook de werkmap terugzetten naar een eerdere toestand in de tijd,\r\neen eerdere versie van de werkmap. Het geeft je de mogelijkheid om te\r\nexperimenteren, bij succes de veranderingen over te nemen en bij geen\r\nsucces de veranderingen ongedaan te maken.\r\nEr zijn twee soorten versiebeheersystemen:\r\ngecentraliseerd: Hierbij is er één centrale server\r\nwaarop alle versies van de bestanden staan. Wanneer iemand met een\r\nbestand wil werken moet deze eerst van deze server worden opgehaald\r\n(check out).\r\ngedistribueerd: Hierbij staat de volledige\r\nrepository op een of meerdere computers. Je bent dus niet afhankelijk\r\nvan een centrale server of database. En wanneer je niet met anderen\r\nsamenwerkt aan de bestanden heb je ook geen server nodig en volstaat een\r\nrepository op de lokale schijf. Wanneer je wel met anderen samenwerkt\r\ndan heb je ook een remote repository nodig.\r\nGit is een vrij gedistribueerd versiebeheersysteem\r\nen is beschikbaar voor Windows, macOS en Unix/Linux. Je moet de Git\r\nsoftware installeren op elke computer van waaraf je wilt werken. Na\r\ninstallatie zijn er twee Git clients beschikbaar:\r\nGit Bash - een terminal, vergelijkbaar met de Windows\r\ncommand terminal\r\nGit Gui - een eenvoudige Gui\r\nVanuit deze clients kun je Git-opdrachten uitvoeren. Je moet dan wel\r\nde syntax van de opdrachten kennen en letterlijk intypen. Veel\r\nprogrammeurs werken op deze manier.\r\nGelukkig zijn er ook (gratis) Git GUI clients met meer mogelijkheden,\r\nzoals GitKraken (Windows, Mac\r\n& Linux) en SourceTree\r\n(Windows, Mac). En ook in de RStudio Desktop is een Git client\r\ngeïntegreerd.\r\nNieuwe repository\r\nGeef in de projectmap de opdracht om een nieuwe repository te maken.\r\nIn Git termen heet deze map dan de werkmap.\r\nGeef aan welke bestanden in de repository moeten komen of daar\r\nmoeten worden bijgewerkt. In Git termen heet dit dat de bestanden in de\r\nstage terecht komen.\r\nGeef aan dat de bestanden in de stage permanent in de repository\r\nmoeten worden opgeslagen. Dit heet een commit\r\n\r\n\r\n\r\nNa elke verandering kun je de laatste twee stappen opnieuw uitvoeren.\r\nZo ontstaat er een keten van wijzigingen.\r\nDe aanpassingen zitten nu in de lokale repository. Wanneer je in je\r\neentje aan de bestanden werkt is dit in principe voldoende. Wanneer je\r\neen backup wilt of je wilt samenwerken met anderen aan deze bestanden,\r\ndan moet er een soort kopie van de repository op een andere lokatie\r\nkomen waar een Git server geïnstalleerd is. Zo’n lokatie is bijvoorbeeld\r\nGitHub. In Git termen heet deze repository een\r\nremote repository.\r\nOm dit voor elkaar te krijgen moet er op GitHub een repository worden\r\naangemaakt. Daarna moet je in de lokale repository eenmalig een opdracht\r\ngegeven om een verbinding te leggen tussen de lokale en de remote\r\nrepository. Daarna kun je de aanpassingen in de lokale repository\r\ndoorsturen naar de remote repository. In Git heet dit een\r\npush.\r\nKloon een repository\r\nWanneer iemand anders ook met de bestanden wil werken, dan kan deze\r\npersoon de remote repository klonen. Er wordt dan een lokale werkmap\r\ngemaakt die de volledige repository bevat, dus met alle bestanden.\r\nVeranderingen die in de remote repository ontstaan kunnen weer naar de\r\nlokale repository gehaald worden via een pull\r\nopdracht.\r\n\r\n\r\n\r\nUiteraard wordt er goed voor gezorgd dat er geen chaos ontstaat\r\ndoordat verschillende personen aan hetzelfde bestand werken. Het voert\r\nin dit stadium te ver om op alle aspecten dieper in te gaan. Voor\r\nuitvoerige documentatie zie het online boek Pro Git\r\nBranches\r\nEen andere handigheid is dat je in Git zeer eenvoudig een nieuwe\r\nbranche (aftakking) kunt maken. Deze aftakking staat los van de\r\nhoofdtak (master of main geheten) en je kunt hierin eigen ontwikkelingen\r\ndoen. Het is mogelijk om zo’n aftakking weer samen te voegen met de\r\nhoofdtak.\r\nVoor mijn eigen werk heb ik, zoals de meeste anderen, een branche\r\ndevelop geheten. Hierin voeg ik nieuwe inhoud toe, test het en\r\nwanneer het resultaat ok is voeg ik het weer in de hoofdtak.\r\nWanneer ik een repository van iemand anders naar mijn lokale PC kloon\r\nmaak ik meestal een nieuwe branch waarin ik dan mijn wijzigingen en\r\naanvullingen aanbreng. Deze branch wordt uiteraard niet samengevoegd met\r\nde hoofdbranch want die is van iemand anders. Wat wel kan is een\r\npull request indienen, zie verderop.\r\nGitHub\r\nGitHub is een online platform dat\r\nin eerste instantie bedoeld was voor het plaatsen van bronbestanden voor\r\nopen source software. Het is gebouwd rond Git en is gaandeweg een zeer\r\ngroot en geavanceerd ontwikkelplatform geworden. GitHub is in 2018 door\r\nMicrosoft overgenomen.\r\nVoor het maken van een repository op GitHub moet je eerst een\r\n(gratis) account maken. Je kunt er prive repositories plaatsen, maar de\r\nmeeste repositories zijn public en zijn voor iedereen toegankelijk, in\r\ndie zin dat je de inhoud kunt bekijken en naar je eigen computer kunt\r\nklonen. Voor mijn repositories op GitHub zie: https://github.com/bwelman. De repositories voor mijn\r\ncursusboeken zijn allemaal public.\r\nNetlify\r\nNetlify is een hosting platform met een op Git\r\ngebaseerde workflow en uitvoerige mogelijkheden tot integratie met\r\nrepositories op GitHub. Het proces ziet er schematisch als volgt\r\nuit:\r\n\r\n\r\n\r\nSamenwerking\r\nEr zijn meerdere mogelijkheden tot samenwerking.\r\nAllereerst heeft de repository site een\r\naantal tabs hiervoor.\r\nIssues - Vooral bedoeld om fouten te melden en\r\nverzoeken om nieuwe onderdelen/mogelijkheden toe te voegen. De\r\nafhandeling ervan kan gevolgd worden.\r\nDiscussions - Voor het voeren van een discussie\r\nover iets, voor het stellen en beantwoorden van vragen, voor het delen\r\nvan informatie, voor het doen van aankondigingen.\r\nPull requests - Dit is het verzoek van iemand om\r\nzijn branch in de hoofdtak op te nemen. In die branch zitten\r\nvoorgestelde wijzigingen. De eigenaar van de repository bekijkt deze\r\nwijzigingen en neemt dan een beslissing tot wel of niet opnemen.\r\nIssues en discussions zijn eenvoudig te gebruiken en daar kan ook\r\neigenlijk niets mis gaan. Een pull request is wat ingewikkelder en heeft\r\nwat meer uitleg nodig.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-04-14-workflow-studieboeken/workflow-studieboeken_files/figure-html5/unnamed-chunk-1-1.png",
    "last_modified": "2022-06-08T10:01:18+02:00",
    "input_file": {},
    "preview_width": 1248,
    "preview_height": 768
  },
  {
    "path": "posts/2021-02-02-unieke-records-access/",
    "title": "Unieke waarden/Records in Access Queries",
    "description": "Uitleg over het verschil tussen deze twee query opties in MS Access.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2021-02-02",
    "categories": [
      "access",
      "queries"
    ],
    "contents": "\r\n\r\nContents\r\nInleiding\r\nqry\r\nKlanten standaard\r\nqry Klanten unieke waarden\r\nqry Klanten unieke records\r\n\r\nInleiding\r\nIn het eigenschappen venster van een query zijn twee opties,\r\nUnieke Waarden en Unieke Records. Standaard staat de\r\nwaarde voor beiden op Nee. Deze leveren soms dezelfde waarden\r\nop, maar er zijn significante verschillen wanneer je een van beide op\r\nJa zet. Verder kun je niet beide waarden op Ja\r\nzetten.\r\n\r\nDeze eigenschappen corresponderen met respectievelijk de SQL\r\nopdrachtenDISTINCT en DISTINCTROW.\r\n\r\nStandaard, wanneer beide eigenschappen dus\r\nNee zijn, worden alle records getoond die aan de\r\nqueryvoorwaarden voldoen.\r\nUnieke Waarden (DISTINCT in SQL) controleert\r\nalleen de uitvoervelden van de query en verwijdert daarna de dubbele\r\nrijen. Bij meerdere uitvoervelden moet de combinatie van alle\r\nuitvoervelden uniek zijn.\r\nUnieke Records (DISTINCTROW in SQL) daarentegen\r\ncontroleert alle velden in de tabel die wordt opgevraagd en verwijdert\r\nduplicaten. De getoonde records moeten uniek zijn op basis van alle\r\nvelden in de onderliggende tabellen en niet alleen de velden in de\r\nquery.\r\nVerdere uitleg via een Voorbeeld met een eenvoudige database\r\n“Voorbeeld_Uniek.accdb”. Deze bevat twee tabellen:\r\n\r\n\r\n\r\nFigure 1: Tabel Klanten.\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 2: Tabel Orders.\r\n\r\n\r\n\r\nTussen de tabellen is een een-op-veel relatie van Klanten.Klantnr\r\n> Orders.Klantnr.\r\nZoals je ziet zijn er twee verschillende klanten met dezelfde naam\r\nvoor Bedrijf. In de query’s hierna wordt steeds deze naam getoond voor\r\nde drie verschillende mogelijkheden.\r\nqry Klanten standaard\r\nOntwerp\r\nOnder deze naam is een query gemaakt waar beide tabellen aan zijn\r\ntoegevoegd. Het ontwerpvenster ziet er als volgt uit:\r\n\r\n\r\n\r\nFigure 3: Ontwerp query Klanten standaard.\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 4: Eigenschappen query Klanten standaard.\r\n\r\n\r\n\r\nWanneer je met SQL werkt, dan is de opdracht:\r\nSELECT Klanten.Bedrijf\r\nFROM Klanten\r\nINNER JOIN Orders ON Klanten.Klantnr = Orders.Klantnr;\r\nRESULTAAT\r\n\r\n\r\n\r\nFigure 5: Vier rijen, voor elke klantorder is er een\r\nrij, alle records worden getoond.\r\n\r\n\r\n\r\nqry Klanten unieke waarden\r\nOntwerp\r\nIn het Eigenschappenvenster wordt\r\nUnieke waarden = Ja.\r\n\r\n\r\n\r\nFigure 6: Ontwerp qry Klanten unieke waarden.\r\n\r\n\r\n\r\nWanneer je met SQL werkt, dan is de opdracht:\r\nSELECT DISTINCT Klanten.Bedrijf\r\nFROM Klanten\r\nINNER JOIN Orders ON Klanten.Klantnr = Orders.Klantnr;\r\nResultaat\r\n\r\n\r\n\r\nFigure 7: Twee unieke rijen, de resultaten\r\nworden beperkt tot unieke waarden in het uitvoerveld.\r\n\r\n\r\n\r\nqry Klanten unieke records\r\nOntwerp\r\nIn het Eigenschappenvenster wordt\r\nUnieke records = Ja.\r\n\r\n\r\n\r\nFigure 8: Ontwerp qry Klanten unieke records.\r\n\r\n\r\n\r\nWanneer je met SQL werkt, dan is de opdracht:\r\nSELECT DISTINCTROW Klanten.Bedrijf\r\nFROM Klanten\r\nINNER JOIN Orders ON Klanten.Klantnr = Orders.Klantnr;\r\nResultaat\r\n\r\n\r\n\r\nFigure 9: Drie rijen, want de resultaten in alle\r\nonderliggende tabellen moeten uniek zijn, dus niet de uitvoervelden.\r\n\r\n\r\n\r\nJe ziet hier twee keer “Jansen BV”. Weliswaar is dat niet uniek in\r\nhet uitvoerveld, maar ze zijn uniek omdat de ene in Amsterdam zit en de\r\nandere in Londen.\r\nWanneer je zelf met deze datase wilt werken dan kun je deze hier\r\ndownloaden: Database\r\nVoorbeeld_Uniek\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-02-02-unieke-records-access/qry-uniekewaarden-ontwerp.png",
    "last_modified": "2022-06-08T10:04:57+02:00",
    "input_file": {},
    "preview_width": 261,
    "preview_height": 217
  },
  {
    "path": "posts/2020-08-04-netlify-drop/",
    "title": "Netlify Drop",
    "description": "Hoe je snel een website online kunt brengen.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2020-08-04",
    "categories": [
      "netlify",
      "website"
    ],
    "contents": "\r\nWil je snel, eenvoudig, gratis en zonder aanmelding voor een account\r\neen website online brengen dan kun je gebruik maken van Netlify Drop. Het enige wat je\r\nhoeft te doen is de map met daarin jouw website (HTML, CSS, Javascript)\r\nin een vak te slepen. Binnen zeer korte tijd is de site online en heb je\r\neen URL die je met anderen kunt delen. Deze manier van werken is erg\r\nhandig in het onderwijs. Cursisten hebben op deze manier snel een\r\ndeelbare link.\r\nWanneer je de nieuwe website niet claimt dan wordt deze na 24 uur\r\nautomatisch verwijderd. Wanneer de site permanent in de lucht moet\r\nblijven dan heb je een (gratis) Netlify account nodig.\r\n\r\n\r\n\r\n",
    "preview": "posts/2020-08-04-netlify-drop/netlify-drop.jpg",
    "last_modified": "2022-06-08T10:05:18+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2020-05-24-latex-werkomgeving/",
    "title": "Latex werkomgeving",
    "description": "Hoe een werkomgeving voor Latex eruit kan zien.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2020-05-24",
    "categories": [
      "latex"
    ],
    "contents": "\r\nLaTeX is een zeer krachtige opmaaktaal voor het maken van\r\ngestructureerde documenten. Het kan voor elk soort document gebruikt\r\nworden maar is uitermate geschikt voor documenten die wiskunde bevatten.\r\nHet is in de academische wereld van de wiskunde en natuurwetenschappen\r\nhet meest gebruikte schrijfgereedschap. Het leent zich uitstekend voor\r\nhet maken van scripties, artikelen, boeken, researchrapporten,\r\npresentaties, … En LaTeX zelf is ook nog eens gratis.\r\nEen LaTeX bestand is een plat tekstbestand met de extensie\r\n.tex en kun je in principe met Kladblok of Notepad maken.\r\nEr zijn echter betere alternatieven, zie verderop. Zo’n\r\n.tex bestand moet gecompileerd worden naar een\r\npdf bestand. Daarvoor moet je over een LaTeX omgeving\r\nbeschikken. Je kunt zo’n omgeving op een computer installeren, maar er\r\nzijn ook online mogelijkheden.\r\nWindows installatie\r\nLaTeX kun je op elk systeem installeren. Hier volgen alleen een paar\r\nkorte instructies voor het opzetten van een LaTeX werkomgeving op een\r\nWindows computer.\r\nDownload een basic installatie van MiKTeX en voer de installatie\r\nuit.\r\nMiKTeX is een TeX/LaTeX implementatie voor Windows en bevat de\r\ncompiler. De installatie is eenvoudig en na afloop is er een grafische\r\nMiKTeX console beschikbaar waarmee je instellingen kunt regelen en\r\nupdates kunt uitvoeren.\r\nDownload en installeer een editor (optioneel)\r\nMet MiKTeX wordt ook de editor TeXworks meegeleverd. Dit is\r\neen goed bruikbare maar vrij kale editor. Mijn voorkeur gaat naar een\r\nmeer geavanceerdere editor uit, zoals een van de volgende (gratis)\r\nprorogramma’s:\r\nTexmaker\r\nTeXstudio\r\nOnline werkomgeving\r\nIn plaats van te kiezen voor een lokale installatie op je computer\r\nkun je er ook voor kiezen om met een online TeX/LaTeX omgeving te\r\nwerken. De meest bekende is Overleaf. Deze biedt drie\r\nsmaken aan: Personal, Collaborator en Professional. Alleen de Personal\r\nomgeving is gratis en kent geen integratie met cloudomgevingen als\r\ndropbox en GitHub en ook zijn er mogelijkheden tot samenwerken met\r\nanderen.\r\nDe huidige online omgeving van Overleaf is gebouwd op basis van de\r\nShareLateX editor, die daardoor niet meer als\r\nafzonderlijke online editor bestaat.\r\nOverleaf kent verder een uitstekende documentatie omgeving met\r\ngidsen en tutorials over hoe je dingen in LaTeX voor elkaar kunt\r\nkrijgen.\r\nGebruik Overleaf: ga naar https://www.overleaf.com/\r\nVoordat je Overleaf kunt gebruiken moet je eerst een account\r\naanmaken. Naast een eigen account kun je ook inloggen met bijvoorbeeld\r\njouw Google of Twitter account.\r\nDe organisatie van documenten is in de vorm van projecten. Een\r\nproject kan naast één of meerdere .tex bestanden ook\r\nreferentiebestanden, afbeeldingen, stijlen, … bevatten. De\r\nprojectbestanden worden in jouw persoonlijke omgeving van Overleaf\r\nopgeslagen, maar kunnen ook gedownload worden naar de lokale computer.\r\nEn omgekeerd kun je ook bestanden van de computer uploaden naar een\r\nproject in Overleaf.\r\n\r\n\r\n\r\n",
    "preview": "posts/2020-05-24-latex-werkomgeving/preview.png",
    "last_modified": "2022-06-08T10:06:19+02:00",
    "input_file": {},
    "preview_width": 307,
    "preview_height": 131
  },
  {
    "path": "posts/2020-05-17-aselecte-getallen/",
    "title": "Aselecte getallen",
    "description": "Over hoe willekeurige getallen kunt genereren in Excel.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2020-05-17",
    "categories": [
      "excel",
      "aselect",
      "random",
      "statistiek",
      "matrix"
    ],
    "contents": "\r\n\r\nContents\r\nASELECT\r\nFuncties\r\nAnalysis Toolpak\r\n(Gegevensanalyse)\r\nLees verder\r\n\r\nVoor onderwijskundige doeleinden is het soms nodig om zelf data te\r\ngenereren omdat je bijvoorbeeld een specifiek patroon in de data wilt\r\nbehandelen en daar geen goede data voor hebt.\r\nAselecte getallen, ook wel willekeurige getallen of toevalsgetallen\r\ngenoemd, worden gemaakt met een zogenaamde toevalsgenerator (random\r\ngenerator). Deze trekt willeurig (aselect) een getal uit een\r\nverzameling getallen. Zo haalt de ballenmachine bij Lotto een\r\nwillekeurig getaL uit de verzameling getallen 1 t/m 45.\r\nComputerprogramma’s gebruiken meestal een algoritme waarin via\r\nwiskundige formules een getal geproduceerd wordt. Excel maakt net als\r\nveel andere programma’s gebruikt van het zogenaamde Mersenne Twister\r\nalgoritme. Dit zijn in werkelijkheid geen echte willekeurige getallen,\r\nmaar pseudo-willekeurige getallen omdat ze op een voorspelbare manier\r\ngeproduceerd zijn. Voor de meeste doeleinden is dit geen probleem.\r\nBij het genereren van een getal wordt altijd aangeven binnen welke\r\ngrenzen (ondergrens, bovengrens) het getal moet liggen. Dit interval\r\nwordt aangeduid met een combinatie van ronde haken () en blokhaken [].\r\nEen ronde haak betekent dat de grenswaarde niet tot de klasse behoort.\r\nEen blokhaak betekent dat de grenswaarde wel tot de klasse behoort. Zo\r\nhoort bij het interval [25,40) de waarde 25 er wel bij en de waarde 40\r\nniet.\r\nIn Excel kun je aselecte getallen te genereren met functies en met de\r\nanalysis toolpak.\r\nASELECT Functies\r\nExcel heeft drie functies voor het genereren van aselecte getallen.\r\nEen mogelijk nadeel van het gebruik van functies is dat deze iedere keer\r\nopnieuw worden uitgevoerd wanneer je een wijziging in een werkblad\r\naanbrengt en ook wanneer je het bestand opent. Je krijgt dan steeds\r\nnieuwe getallen. Dat is niet in alle situaties handig. Wat je kunt doen\r\nis deze getallen na het genereren te kopieren en daarna te plakken als\r\nwaarden.\r\nASELECT(), in het Engels RAND()\r\nSyntax: ASELECT() , de functie heeft geen argumenten\r\nDeze produceert een getal groter of gelijk aan 0 en kleiner dan 1.\r\nDus een decimaal getal in het interval [0,1). Om meerdere willekeurige\r\ngetallen te krijgen plaats je deze formule in een cel en kopieer\r\nvervolgens de formule naar andere cellen. En om willekeurige decimale\r\ngetallen tussen andere grenswaarden te krijgen, in het interval\r\n[ondergrens,bovengrens) wijzig je de formule in\r\n=ondergrens + ASELECT()*(bovengrens-ondergrens)\r\nIn de volgende afbeelding zie je hoe willekeurige getallen in het\r\ninterval [10,50) zijn gegenereerd.\r\nWillekeurige getallen in het interval\r\n[10,50) met functie ASELECTWanneer je gehele getallen wilt moet je voorgaande formule binnnen de\r\nfunctie INTEGER() plaatsen, die een getal naar beneden\r\nafrondt op het dichtstbijzijnde gehele getal.\r\nASELECTTUSSEN(), in het Engels\r\nRANDBETWEEN()\r\nSyntax: ASELECTTUSSEN(laagst;hoogst)\r\nlaagst, het kleinste gehele getal dat geretourneerd kan\r\nworden.\r\nhoogst, het grootste gehele getal dat geretourneerd kan\r\nworden\r\nDeze functie produceert een willekeurig geheel getal uit het interval\r\n[laagst,hoogst]. In tegenstelling tot ASELECT() doen hier beide\r\ngrenswaarden mee.\r\nWillekeurige getallen uit het interval 10\r\nt/m 50 met functie ASELECTTUSSENMet wat trucs kun je ook andere getallen dan gehele getallen\r\ngenereren. Zo zou je voor prijzen van artikelen die tussen €10,00 en\r\n€90,00 liggen gebruik kunnen maken van de formule in de volgende\r\nafbeelding:\r\nWillekeurige getallen uit het interval\r\n10,00 t/m 90,00Om twee decimalen te krijgen worden de grenswaarden 10 en 90 eerst\r\nmet 100 vermenigvuldigd. Dan wordt er een getal gegenereerd uit het\r\ninterval [1000,9000] waarna dit getal door 100 gedeeld wordt en je\r\nprecies twee decimalen krijgt. De cellen kun je vooraf of achteraf\r\nopmaken als geldbedragen.\r\nEn door creatief gebruik te maken van afrondfuncties zijn er\r\nverrassende mogelijkheden. Het volgende voorbeeld genereert 5-vouden uit\r\nhet interval [0,100].\r\nWillekeurige vijfvoudenOok het genereren van datums (alsmede tijdstippen) is hiermee\r\nmogelijk, omdat intern in Excel een datum en tijd als een getal wordt\r\nopgeslagen. Zo staat het getal 1 voor “1-1-1900 00:00:00”. In het\r\nvolgende voorbeeld worden willekeurige datums uit het jaar 2019\r\ngegenereerd. Ook hier moet je de cellen waarin het resultaat komt,\r\nopmaken in het gewenste datumformaat.\r\nWillekeurige datums in 2019OPMERKING: In plaats van de functie DATUM() kun je hier\r\nook de functie DATUMWAARDE() gebruiken. De formule wordt\r\ndan\r\n=ASELECTTUSSEN(DATUMWAARDE(\"1-1-2019\");DATUMWAARDE(\"31-12-2019\"))\r\nASELECT.MATRIX(), in het Engels\r\nRANDARRAY()\r\nSyntax:\r\nASELECT.MATRIX(rijen;kolommen;min;max;geheel)\r\nrijen, het aantal rijen met getallen dat geretourneerd moet\r\nworden (optioneel)\r\nkolommen, het aantal kolommen met getallen dat\r\ngeretourneerd moet worden (optioneel)\r\nmin, de minimale waarde die geretourneerd kan worden\r\n(optioneel)\r\nmax, de maximale waarde die geretourneerd kan worden\r\n(optioneel)\r\ngeheel, WAAR voor gehele getallen, ONWAAR voor decimale\r\ngetallen (optioneel)\r\n\r\nDeze functie is op het moment van schrijven alleen in Excel 365\r\nbeschikbaar voor Microsoft subscribers\r\n\r\nDe functie produceert een matrix (array) met willekeurige\r\ngetallen. Zonder argumenten wordt er één getal tussen 0 en 1\r\ngeretourneerd. Wanneer de minimum- en maximumwaarde worden weggelaten,\r\nworden er getallen tussen 0 en 1 geretourneerd.\r\nAls voorbeeld weer het genereren van gehele getallen tussen 10 en 50.\r\nDe formule is =ASELECT.MATRIX(3;4;10;50;WAAR).\r\nIn tegenstelling tot de vorige functies selecteer je hier maar één\r\ncel waar je de formule invoert. Het resultaat is een array, een nieuwe\r\ngegevensstructuur in Excel. De waarden van de array komen niet alleen in\r\nde geselecteerde cel, maar lopen over naar de naburige cellen.\r\nExcel maakt dynamisch de benodigde ruimte voor de array wanneer de\r\nformule ingevoerd wordt. Wanneer een van die benodigde cellen bezet is\r\nkrijg je een foutmelding.\r\nEen array van 3 rijen en 4 kolommen met\r\nwillekeurige getallen van 10 t/m 50Dit ziet er bij de eerste aanblik hetzelfde uit als bij\r\nASELECTTUSSEN(), maar er zijn verschillen omdat het een array is.\r\nAllereerst zie je een lichtblauw kader om de array. En wanneer je een\r\nandere cel selecteert dan die waar de formule is ingevoerd, zie je in de\r\nformulebalk dat de formule grijs geworden is. Ook kun je in de andere\r\ncellen geen wijzigingen aanbrengen.\r\nMeer informatie over dynamische arrays komt in afzonderlijke\r\nartikelen.\r\nAnalysis Toolpak\r\n(Gegevensanalyse)\r\nIn de Analysis Toolpak zit ook een keuze om willekeurige getallen te\r\ngenereren. Het gebruik hiervan is wat flexibeler dan het werken met de\r\nhiervoor genoemde functies. De werkwijze is als volgt. Kies\r\ntabblad Gegevens -> Gegevensanalyse (groep Analyse) ->\r\nAselecte getallen\r\nHet dialoogscherm dat je krijgt kan wat van het volgende afwijken,\r\nmaar ziet er grotendeels hetzelfde uit.\r\nDialoogscherm Aselecte\r\ngetallenAantal variabelen: het aantal kolommen in het uitvoergebied\r\ndat je met waarden wilt vullen.\r\nAantal aselecte getallen: het aantal rijen in het\r\nuitvoergebied dat je met waarden wilt vullen.\r\nJe kunt deze twee invulvakken ook leeg laten.In dat geval wordt het\r\nverderop gespecificeerde uitvoergebied met waarden gevuld.\r\nVerdelingstype: keuzemogelijkheden Uniforme verdeling,\r\nNormale verdeling, Bernouilli verdeling, Binomiale verdeling, Poisson\r\nverdeling, Patroonmatige verdeling, Discrete verdeling.\r\nVoor het genereren van willekeurige getallen tussen twee grenzen kies\r\nje voor Uniforme verdeling. Afhankelijk van de gekozen verdeling wijzigt\r\nhet scherm zodat je de parameters voor de gekozen verdeling kunt\r\ninvullen. Bij een Uniforme verdeling zijn dat de twee grenswaarden,\r\naangegeven met Tussen … en …\r\nAselecte waarde maken: Hier kun je desgewenst een startpunt\r\n(de zogenaamde seed) voor de random generator opgeven, waardoor je een\r\nvolgende keer dezelfde willekeurige getallen kunt produceren. In het\r\nalgemeen kun je dit beter leeg laten.\r\nUitvoeropties: Gebruik de selectieknoppen om de locatie\r\nvoor de willekeurige getallen aan te geven.\r\nAls voorbeeld worden weer getallen gegenereerd tussen 10 en 50.\r\nInvulling dialoogscherm voor het\r\ngenereren van willekeurige getallen tussen 10 en 50Het resultaat ziet er ongeveer uit als volgt:\r\nResultaat gegevensanalyseEr staat geen formule in een van de cellen. De getallen veranderen\r\ndan ook niet wanneer er een wijziging in het werkblad komt.\r\nEr worden altijd decimale getallen geproduceerd. Wil je gehele\r\ngetallen hebben, dan zul je deze daarna nog met een functie moeten\r\nomzetten naar gehele getallen.\r\nLees verder\r\nMicrosoft\r\nsupport, support voor ASELECT functie waarin tevens de naam van het\r\nalgoritme genoemd wordt.\r\nMersenne\r\nTwister algoritme (Wikipedia)\r\nRandom.org, website met\r\nartikelen over toevalsgetallen en een aantal gratis online random\r\ngenerators voor echte toevalsgetallen door gebruik te maken van\r\nastronomische ruis.\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2020-05-17-aselecte-getallen/preview.png",
    "last_modified": "2022-06-08T10:06:54+02:00",
    "input_file": {},
    "preview_width": 285,
    "preview_height": 205
  },
  {
    "path": "posts/2020-05-13-histogrammen-1/",
    "title": "Histogrammen (deel 1)",
    "description": "Hoe je frequentieverdelingen in Excel maakt.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2020-05-13",
    "categories": [
      "excel",
      "histogram",
      "statistiek"
    ],
    "contents": "\r\nBracht het maken van een histogram in oudere versies van Excel veel\r\nhandwerk met zich mee, in de nieuwere versies (Excel 365, Excel 2016) is\r\ndit een stuk gemakkelijker gemaakt. Een probleem is wel dat het\r\nhistogram er vaak nooit zo uitziet als je graag zou willen. En dat het\r\nmaken van bepaalde aanpassingen soms moeilijk tot zelfs onmogelijk is,\r\nwaardoor je toch weer op het handwerk met formules terug moet\r\ngrijpen.\r\nIn een aantal artikelen wordt aandacht besteed aan wat je allemaal\r\ntegen kunt komen. In dit eerste deel gaat het over de basis voor een\r\nhistogram, de frequentieverdeling.\r\nFrequentieverdelingen\r\nOm het gedrag van een variabele te bestuderen ga je waarden van die\r\nvariabele verzamelen, bijvoorbeeld door metingen uit te voeren. De\r\nfrequentie van een waarde is het aantal malen dat die waarde\r\nvoorkomt. Deze frequenties worden dan geordend in een tabel waardoor er\r\neen frequentieverdeling ontstaat.\r\nNaast deze absolute frequentie kun je ook de relatieve\r\nfrequentie bepalen. Dit is het aantal malen dat een meetwaarde\r\nvoorkomt gedeeld door het totaal aantal waarnemingen. De relatieve\r\nfrequentie wordt uitgedrukt als fractie of als een percentage. En tot\r\nslot kun je ook nog de cumulatieve frequentie bepalen. Dit is\r\nde som van alle frequenties tot en met de frequentie van de\r\ndesbetreffende waarde. En de cumulatieve frequentie kun je zowel\r\nabsoluut als relatief uitdrukken.\r\nMeestal zijn er van een variabele veel meetwaarden beschikbaar. Dan\r\nis het niet handig om van de afzonderlijke waarden een\r\nfrequentieverdeling te maken omdat dit een lange lijst wordt welke niet\r\nmeer inzicht in de variabele zal geven. In dat geval worden de\r\nfrequenties samengevat in groepen, zogenaamde klassen of ook\r\nwel bins geheten.. Het samenbrengen in klassen heet ook wel\r\nclassificeren.\r\nDe grenzen van de klasse, de ondergrens en bovengrens, worden met een\r\ncombinatie van ronde haken () en blokhaken [] aangeduid. Een ronde haak\r\nbetekent dat de grenswaarde niet tot de klasse behoort. Een blokhaak\r\nbetekent dat de grenswaarde wel tot de klasse behoort. Zo hoort bij een\r\nklasse aangeduid met [25,40) de waarde 25 wel tot de klasse, maar de\r\nwaarde 40 niet.\r\nDe klassebreedte is het verschil tussen de bovengrens en de\r\nondergrens van een klasse. Zo heeft de klasse [25,40) een klassebreedte\r\n15. Het bepalen van de klassebreedte wordt door de onderzoeker bepaald\r\nen hangt vaak van de onderzoeksvraag af. Ook voor het totaal aantal\r\nklassen gelden geen harde afspraken. Is de klassebreedte groot, dan heb\r\nje minder klassen, maar krijg je ook minder inzicht. Sommige\r\nonderzoekers hanteren als vuistregel voor het aantal klassen: maximaal\r\nde wortel uit het totaal aantal waarnemingen.\r\nVoor het maken van klassen gelden de volgende regels.\r\nHarde regels:\r\nDe klassen mogen geen overlappingen vertonen. Een waarneming moet\r\nslechts in één klasse ondergebracht kunnen worden. Een klassindeling met\r\nhierin de klassen [25,50] en [50,75] kan dus niet. Want dit zou inhouden\r\ndat de waarde 50 tot 2 klassen kan behoren.\r\nVoor elke waarneming moet er een klasse beschikbaar zijn. Dus alle\r\nwaarnemingen moeten in een klasse ondergebracht kunnen worden. Vaak\r\nworden daarom de eerste en laatste klasse extra groot gemaakt.\r\nZachte regels (voor de klassebreedte):\r\nAls het kan maak dan de klassen even breed. Veel software (en vooral\r\nExcel) kan hier beter mee overweg dan wanneer de klassen niet even breed\r\nzijn. Voor de eerste en de laatste klasse lukt dat niet alijd omdat alle\r\nwaarnemingen opgevangen moeten worden. Daarnaast kunnen er ook andere\r\nredenen zijn om de klassen niet even breed te maken. Ook worden soms\r\nklassen waarin weinig waarnemingen zitten samengevoegd waardoor een\r\nbredere klasse ontstaat.\r\nDe klassen moeten wel voldoende differentieren, verschillen\r\nvertonen. Zo heeft het weinig zin om voor de inkomensverdeling in\r\nNederland een klasse van €10.000 tot €60.000 te maken, omdat hierin\r\nbijna alle inkomens (> 90%) vallen.\r\nEen histogram is een grafische weergave van een\r\nfrequentieverdeling van gegevens.\r\nVoorbeeld testscores\r\nAan een test wordt door 100 personen deelgenomen. De volgende tabel\r\ngeeft een overzicht van de frequenties, relatieve frequenties en\r\ncumulatieve relatieve frequenties. De laatste twee als fracties. Alle\r\nklassen hebben hier dezelfde breedte 10.\r\nscore\r\nfreq.\r\nrel. freq.\r\ncum. rel. freq.\r\n[10,20)\r\n14\r\n0,14\r\n0,14\r\n[20,30)\r\n40\r\n0,40\r\n0,54\r\n[30,40)\r\n35\r\n0,35\r\n0,89\r\n[40,50)\r\n11\r\n0,11\r\n1,00\r\nHistogram met klassebreedte\r\n10In dit voorbeeld werd uitgegaan van een bestaande\r\nfrequentieverdeling. De gegevens zelf zijn door het classificeren niet\r\nmeer bekend, waardoor er veel informatie verdwenen is. Wanneer je wat\r\ndieper op de verdeling zou willen inzoomen, moet je de klassebreedte\r\nverkleinen naar bijvoorbeeld 5, zoals in de volgende afbeelding te zien\r\nis.\r\nHistogram met klassebreedte\r\n5Beide diagrammen zijn tot stand gekomen door een kolomdiagram in\r\nExcel te maken. Wie dit zelf na wil maken in Excel kan het bestand testscores.xlsx downloaden. Hierin\r\nzijn ook de benodigde aanwijzingen voor het maken van dit diagram te\r\nvinden. Zoals in het begin van dit artikel is aangegeven heeft Excel\r\nspecifieke hulpmiddelen voor het maken van histogrammen. Deze zullen nog\r\naan bod komen.\r\nIn het volgende artikel zal het maken van een frequentieverdeling van\r\neen gegevensverzameling besproken worden.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-06-08T10:07:17+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2020-06-23-histogrammen-2/",
    "title": "Histogrammen (deel 2)",
    "description": "Hoe je frequentieverdelingen en histogrammen in Excel maakt.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2020-05-13",
    "categories": [
      "excel",
      "histogram",
      "statistiek"
    ],
    "contents": "\r\n\r\nContents\r\nINTERVAL functie (Eng:\r\nFREQUENCY)\r\nDraaitabel\r\nGegevensanalyse (Analysis\r\nToolpak)\r\nGrafiek\r\nHistogram\r\n\r\nIn het eerste artikel over histogrammen werd van een gegeven\r\nfrequentieverdeling gebruik gemaakt. Normaliter moet je van de gegevens\r\neerst een frequentieverdeling maken. Er zijn meerdere manieren om een\r\nfreqentieverdeling te maken, al dan niet met ook een histogram.\r\nMet de formule INTERVAL\r\nMet een draaitabel en draaigrafiek\r\nMet de histogram optie in gegevensanalyse (Analysis Toolpak)\r\nVia Invoegen > grafieken > Histogram (alleen histogram, geen\r\nafzonderlijke frequenties)\r\nWelke manier je gebruikt hangt meestal af van de gewenste uitvoer en\r\nde mogelijkheden tot het maken van aanpassingen.\r\nINTERVAL functie (Eng:\r\nFREQUENCY)\r\nSyntax: INTERVAL(gegevensmatrix;interval_verw)\r\ngegevensmatrix (Eng: data_array), een matrix met de waarden\r\nwaarvan je de frequentie wilt bepalen\r\ninterval_verw (Eng: bins_array), een matrix met de\r\nbovengrenzen van de intervallen waarin je wilt verdelen\r\nAls voorbeeld zijn 25 willekeurige gehele getallen gegenereerd uit\r\nhet interval [1,10]. Hoe je dat moet doen kun je lezen in het artikel Aselecte\r\ngetallen.\r\nHet bestand met deze getallen, alsmede alle uitwerkingen in dit\r\nartikel kun je downloaden via de link frequenties.xlsx.\r\nOm hiervoor een frequentieverdeling te maken moet je eerst de\r\nintervallen vaststellen waarin je de waarden wilt laten vallen. Deze\r\nintervallen of groepen worden meestal bins genoemd.\r\nHiervoor maak je een kolom met de bovengrenzen van de intervallen. In de\r\nafbeelding staan deze in de kolom “bin”.\r\nDe frequenties staan in de kolom “freq” en zijn berekend met de\r\nformule =INTERVAL(A2:A26;C2:C6). Deze formule is een\r\nzogenaamde matrixformule.\r\nExcel 365\r\nIn Excel 365 kun je deze matrixformule gewoon in de begincel D2\r\ninvoeren en vervolgens op Enter drukken. Het resultaat is een kolommetje\r\ngetallen, een matrix. En Excel weet welke cellen nodig zijn voor de\r\nuitvoer en plaatst het resultaat van deze dynamische matrix in\r\ndeze cellen. Deze cellen moeten wel leeg zijn anders krijg je een\r\nfoutmelding.\r\nFrequenties bepaald met functie\r\nINTERVALAndere Excel versies\r\nAndere versies van Excel kunnen niet met deze nieuwe dynamische\r\nmatrices overweg. Hier moet je de formule nog op de “oude” manier\r\ninvoeren. Je moet dan zelf eerst het uitvoerbereik D2:D7 selecteren, dan\r\nde formule intypen en vervolgens op CTRL + SHIFT + ENTER drukken. Excel\r\nplaatst dan zelf accolades {} aan het begin en het einde van de\r\nformule.\r\nHistogram maken\r\nWanneer je eenmaal de frequentieverdeling gemaakt hebt kun je een\r\nhistogram maken op basis van een kolomdiagram. In deel 1 zie je\r\ndaarvan een voorbeeld en in het bijbehorende bestand testscores wordt\r\nuitgelegd hoe je dat moet doen.\r\nHistogramLDraaitabel\r\nOok met een draaitabel kun je een frequentieverdeling maken.\r\nSelecteer het gegevensgebied A1:A26 en dan tab Invoegen >\r\nDraaitabel. Plaats het veld getal in zowel het\r\nrijengebied als het waardengebied. Wijzig de waardeveldinstellingen\r\nzodat het aantal bepaald wordt en niet de som.\r\nVelden voor de draaitabelNu moet je nog groeperen voor de intervals. Selecteer een willekeurig\r\nveld in de draaitabel, rechter muisklik en kies dan Groeperen.\r\nSpecificeer in het dialoogscherm dat wordt begonnen bij 1, geëindigd bij\r\n10 en dat de stapgrootte 2 is. Zie de volgende afbeelding.\r\nInstelling voor het\r\ngroeperenNa het groeperen verschijnt de frequentieverdeling.\r\nFrequentieverdelingGegevensanalyse (Analysis\r\nToolpak)\r\nOok hier moet je net als bij de functie INTERVAL een\r\nbereik voor de grenzen van de intervallen maken.\r\nKies tab Ggegevens > Gegevensanalyse > Histogram.\r\nSpecificeer het invoerbereik en het verzamelbereik, alsmede een cel\r\nvoor het begin van de uitvoer. Wanneer je een histogram wilt kun je in\r\ndit scherm ook aangeven dat er een grafiek gemaakt moet worden\r\n\r\nDe grafiek is een gegroepeerde kolomdiagram die je desgewenst nog\r\nkunt aanpassen. Voor een echt histogram moeten de kolommen aansluitend\r\nzijn zonder lege ruimte ertussen. En de labels op de X-as geven hier\r\nalleen de bovengrens en niet het interval.\r\n\r\nEen nadeel is ook dat wanneer de brondata wijzigt, er geen\r\nherbereking plaatsvindt. De frequentieverdeling (en histogram is\r\nstatisch)\r\nGrafiek Histogram\r\nDe nieuwere Excelversies hebben de mogelijkheid tot het invoegen van\r\neen grafiektype Histogram. Hiervoor heb je in principe alleen\r\nmaar de brondata nodig. Bij de verdeling in intervallen (bins) bepaalt\r\nExcel zelf automatisch deze bins. Maar je kunt via het\r\neigenschappenvenster ook de binbreedte of het aantal bins opgeven. De\r\nbijbehorende intervalgrenzen worden dan door Excel berekend. Wanneer je\r\nook nog de grenswaarden zelf wilt bepalen, dan moet je daarvoor een\r\naparte kolom in het werkblad opnemen.\r\nDe werkwijze is als volgt. Selecteer een getal in het gegevensgebied.\r\nKies dan tab Invoegen > Aanbevolen grafieken > Alle grafieken\r\n> Histogram.\r\n\r\nIn Excel wordt een histogram gewoonlijk als een kolomdiagram\r\nweergegeven met labels onder het midden van de kolom. En de kolommen\r\nworden standaard aaneensluitend getekend.\r\n\r\nWanneer je het aantal bins of de Bin-breedte wilt veranderen,\r\nselecteer dan de horizontale as > Rechter muisklik > As opmaken.\r\nMaak het eigenschappen breed genoeg, anders zijn niet alle invulvelden\r\nzichtbaar.\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2020-06-23-histogrammen-2/freq-gegevensanalyse-resultaat.png",
    "last_modified": "2022-06-08T10:05:49+02:00",
    "input_file": {},
    "preview_width": 600,
    "preview_height": 217
  },
  {
    "path": "posts/2020-04-04-curve-functie/",
    "title": "Curve functie voor grafieken",
    "description": "Hoe je snel en eenvoudig grafieken kunt maken met de functie curve.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2020-04-04",
    "categories": [
      "R"
    ],
    "contents": "\r\nEen zeer handige functie in R is curve() waarmee je op\r\neen eenvoudige manier grafieken kunt tekenen. De syntax is\r\ncurve(expr, from = NULL, to = NULL, n = 101, add = FALSE,\r\n      type = \"l\", xname = \"x\", xlab = xname, ylab = NULL,\r\n      log = NULL, xlim = NULL, ...)\r\nexpr - de naam van een functie of een expressie in\r\ntermen van x.\r\nfrom, to - het domein waarop de grafiek getekend\r\nwordt.\r\nn - het aantal x-waarden dat geëvalueerd wordt\r\nadd - logische waarde om aan te geven of de grafiek aan\r\neen bestaande grafiek moet worden toegevoegd.\r\nxname - karakter voor de variabele in het\r\nfunctievoorschrift (standaard x)\r\nEen zeer eenvoudige opdracht is de volgende\r\n\r\n\r\nToon code\r\ncurve(expr = x+1)\r\n\r\n\r\nFigure 1: Grafiek van f(x) = x +1\r\n\r\n\r\n\r\n\r\nVoor de functie f(x) = x kun je niet expr = x gebruiken.\r\nJe krijgt dan een foutmelding omdat dit niet als een expressie herkend\r\nwordt, waardoor gezocht wordt naar een object met de naam x. Je kunt de\r\nfoutmelding vermijden door expr = (x) of\r\nexpr = x^1 te gebruiken.\r\n\r\n\r\n\r\nToon code\r\ncurve(expr = sin(x) + cos(x), from = 0, to = 2*pi, \r\n      ylab = \"y\", main = \"y = sin(x) + cos(x)\", col = \"blue\", lwd=2)\r\n\r\n\r\nFigure 2: Grafiek met gespecificeerd domein voor x en iets dikkere\r\nblauwe lijn.\r\n\r\n\r\n\r\nGrid toevoegen\r\nErg handig is verder om tevens gebruik te maken van\r\ngrid() die een rechthoekige grid van nx bij\r\nny aan een bestaande grafiek toevoegt. Deze heeft als\r\nargumenten\r\nnx, ny - het aantal rasters in de x en en y richting\r\n(standaard de waarden van de assen)\r\ncol: kleur gridlijn (standaard “lightgray”)\r\nlty: type lijn (standaard “dotted”)\r\nlwd: breedte lijn\r\nequilogs: alleen in gebruik bij logoaritmische\r\nschaal\r\nIn het volgende voorbeeld wordt de grid gebruikt met daarnaast de\r\nschaal voor de y-as. Hierdoor kun je goed zien dat je de grafiek van\r\n\\(|x^2 -1|\\) kunt krijgen uit de\r\ngrafiek van \\(x^2 -1\\) door bij deze\r\nlaatste het deel dat onder de X-as ligt te spiegelen t.o.v. de x-as.\r\n\r\n\r\nToon code\r\npar(mfrow = c(1,2))\r\ncurve(expr = x^2 - 1, from = -2, to = 2, \r\n      ylim = c(-1,3), ylab = \"y\", main = \"x² - 1\")\r\ngrid()\r\ncurve(expr = abs(x^2 - 1), from = -2, to = 2, \r\n      ylim = c(-1,3), ylab = \"y\", main = \"|x² - 1|\")\r\ngrid()\r\n\r\n\r\nFigure 3: Twee grafieken met elkaar vergeleken.\r\n\r\n\r\n\r\nMeerdere grafieken in 1\r\nfiguur\r\nNadat de eerste grafiek getekend is kun je meerdere grafieken\r\ntoevoegen via het argument add = TRUE.\r\n\r\n\r\nToon code\r\ncurve(expr = x^2, from = -3, to = 3, ylab = \"y\", col = \"green\")\r\ncurve(expr = -x + 2, add = TRUE, col = \"red\")\r\ncurve(expr = 0*x + 3, add = TRUE, col = \"blue\")\r\ngrid()\r\n\r\n\r\nFigure 4: Meerdere grafieken in één figuur.\r\n\r\n\r\n\r\nLogaritmische schaal\r\nMet het argument log kun je een logaritmische schaal\r\n(natuurlijke logaritme) specificeren. Mogelijkheden:\r\nlog = \"x\", log = \"y\" en log=\"xy\".\r\nZie hierna het voorbeeld voor \\(y =\r\ne^x\\).\r\n\r\n\r\nToon code\r\ncurve(expr = exp(x), from = 0, to = 10, log = \"y\", ylab = \"Ln(y)\", main = \"y = e^x\")\r\n\r\n\r\nNaam variabele\r\nDe naam van de variabele in het functievoorschrift is standaard x.\r\nMet het argument xname kun je deze wijzigen.\r\n\r\n\r\nToon code\r\ncurve(expr = sin, from = -2*pi, to = 2*pi, xname = \"t\")\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2020-04-04-curve-functie/curve-functie_files/figure-html5/vb04-1.png",
    "last_modified": "2022-06-08T10:07:42+02:00",
    "input_file": {},
    "preview_width": 1248,
    "preview_height": 768
  },
  {
    "path": "posts/2020-03-01-excel-xml-export/",
    "title": "Exceldata naar xml exporteren",
    "description": "Gegevens in een Excel tabel exporteren naar een XML bestand.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2020-03-01",
    "categories": [
      "excel",
      "xml"
    ],
    "contents": "\r\nHet is niet moeilijk om de gegevens in een Excel tabel naar een XML\r\nbestand om te zetten.\r\nDownload het bestand verkopen-data.xlsx en open het vervolgens\r\nin Excel. In een Excel tabel staan de volgende gegevens:\r\n\r\nOm deze naar XML te exporteren moet er eerst een XML schema gemaakt\r\nworden dat gebaseerd is op deze gegevens. In plaats van een officieel\r\nschema of DTD te maken kun je ook een eenvoudig XML bestand maken met\r\ndaarin de eerste twee records. Open een kladblok programma en plaats\r\ndaarin het de volgende tekst.\r\n<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"yes\"?>\r\n<verkopen xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\">\r\n    <record>\r\n       <Voornaam>Roger<\/Voornaam>\r\n       <Achternaam>Rood<\/Achternaam>\r\n       <Verkopen>13873<\/Verkopen>\r\n       <Land>Nederland<\/Land>\r\n       <Kwartaal>KW 3<\/Kwartaal>\r\n    <\/record>\r\n    <record>\r\n       <Voornaam>Berend<\/Voornaam>\r\n       <Achternaam>Blauw<\/Achternaam>\r\n       <Verkopen>12262<\/Verkopen>\r\n       <Land>Belgie<\/Land>\r\n       <Kwartaal>KW 4<\/Kwartaal>\r\n    <\/record>\r\n<\/verkopen>\r\nSla het bestand in dezelfde map als het Excel bestand op onder de\r\nnaam verkopen-schema.xml en sluit het kladblok programma.\r\nGa nu terug naar het geopende Excelbestand. Kies tab\r\nOntwikkelaars > Bron (groep XML). Het XML taak paneel wordt nu\r\ngeopend.\r\n\r\nKlik op XML-toewijzingen om een XML bestand toe te voegen.\r\nEen dialoogvenster wordt nu geopend. Klik hierin op Toevoegen\r\nen selecteer daarna verkopen-schema.xml.\r\nJe krijgt nu een waarschuwing dat de opgegeven XML-bron niet naar\r\neenschema verwijst en dat Excel op basis van dit bestand een schema\r\nmaakt. Klik op OK.\r\n\r\nKlik op OK.\r\n\r\nSleep nu een voor een de vijf elementen (Voornaam, Achternaam,\r\nVerkopen, Land, Kwartaal) uit de XML-boom naar de juiste kolom in het\r\nwerkblad.\r\n\r\nJe kunt controleren of de toewijzing goed uitgevoerd is, door de\r\nelementen in de XML-bron een voor een aan te klikken. De bijbehorende\r\nkolom uit de tabel moet dan geselecteerd worden.\r\nKies tab Ontwikkelaars > Exporteren (groep XML). Bewaar\r\nhet bestand onder de naam verkopen-xml.xml.\r\n\r\n\r\n\r\n",
    "preview": "posts/2020-03-01-excel-xml-export/xml-5.png",
    "last_modified": "2022-06-08T10:09:01+02:00",
    "input_file": {},
    "preview_width": 694,
    "preview_height": 344
  },
  {
    "path": "posts/2020-01-02-latex-markdown/",
    "title": "Latex in Markdown",
    "description": "De mogelijkheden om latex code op te nemen in platte Markdown.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2020-01-02",
    "categories": [
      "latex",
      "markdown"
    ],
    "contents": "\r\nPlatte Markdown ondersteunt Latex niet of niet goed. Wanneer je veel\r\nwiskundige formules gebruikt kun je beter Rmarkdown gebruiken. Dan heb\r\nje ook het voordeel dat je formules kunt laten nummeren en referenties\r\nnaar formules kunt maken.\r\nVoor het geval dat je toch wiskunde in een markdown bestand wilt\r\nopnemen moet je gebruik maken van oplossingen die door Yihui\r\nbeschreven zijn. De door hem genoemde javascript functie wordt via de\r\npartial footer geladen.\r\n\r\nVoor de Latex syntax zie Wikibook\r\nLaTeX/Mathematics\r\n\r\nInline stijl\r\n\\(sin^{2}x + \\cos^{2}x = 1\\) Met\r\nalleen enkele dollartekens: FOUT\r\n$sin^{2}x + \\cos^{2}x = 1$ Met enkele dollartekens\r\ntussen backticks: GOED\r\n\\(sin^{2}x + \\cos^{2}x = 1\\) Tussen\r\n\\( en \\): FOUT\r\n\\(sin^{2}x + \\cos^{2}x = 1\\) Tussen backticks en\r\n\\( en \\): GOED\r\nGebruik van enkele dollartekens wordt afgeraden en op termijn\r\nafgeschaft. Beter dus om de laatste oplossing te gebruiken.\r\nDisplay stijl\r\nDeze gaan goed, ook zonder de extra javascript functie.\r\nWortelformule:\r\n\\[\r\nx = \\frac{-b \\pm \\sqrt{b^2 - 4ac}}{2a}\r\n\\]\r\nSommatie\r\n\\[\r\n\\sum_{i = 1}^{n}{(\\bar{x} - x_i)^2}\r\n\\]\r\nEchter er is ook Latex code die soms fout gaat, zoals de Wet van\r\nGauss:\r\n\\[\\oint_S {E_n dA = \\frac{1}{{\\varepsilon\r\n_0 }}} Q_{inside}\\]\r\nMaar nu hetzelfde tussen backticks:\r\n$$\\oint_S {E_n dA = \\frac{1}{{\\varepsilon _0 }}} Q_{inside}$$\r\nEn nog eentje (dubbele dollartekens tussen backticks):\r\n$$\\begin{vmatrix}a & b\\\\ c & d \\end{vmatrix}=ad-bc$$\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-06-08T10:09:26+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2019-11-03-online-studieboeken/",
    "title": "Online studieboeken",
    "description": "De mogelijkheden om studieboeken online te publiceren.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2019-11-03",
    "categories": [
      "eboek",
      "dita",
      "markdown",
      "pdf",
      "epub"
    ],
    "contents": "\r\nHoe en ook hoe gemakkelijk je een boek online kunt zetten is niet zo\r\nsimpel te beantwoorden. Ik kan eigenlijk alleen maar over mijn eigen\r\nervaringen wat zeggen.\r\nBelangrijke factoren\r\nIn welk formaat zijn de brondocumenten gemaakt en opgeslagen.\r\nWordt de inhoud regelmatig bijgewerkt en moeten deze wijzigingen\r\nsteeds in de onlineversie doorgevoerd worden.\r\nZijn er meerdere auteurs die er aan werken.\r\nIs het gratis toegankelijk of zit het achter een slot\r\n(registratie/inloggen)\r\nOndersteunt het auteursprogramma vormen van publiceren.\r\nMoeten naast de onlineversie nog meerdere uitvoerformaten\r\n(pdf/latex, epub, …) geproduceerd worden.\r\nGelet op de wijze waarop mijn boeken gemaakt en gepubliceerd worden\r\nheb ik op dit moment twee soorten systemen in gebruik, de ene gebaseerd\r\nop DITA/XML en de andere op Markdown.\r\nDITA/XML gebaseerd\r\nDe Excel en Access studieboeken zijn gebaseerd op het DITA\r\nformaat, een bepaald XML formaat. Als auteursomgeving gebruik ik Oxygen XML Editor, een commercieel\r\nprogramma welke ook een educational license heeft. Ik heb hier vele\r\njaren mee gewerkt, maar doe er steeds minder mee (alleen beperkt\r\nonderhoud). De editor heeft mogelijkheden om vanuit dezelfde\r\nbrondocumenten uitvoer te produceren in o.a. HTML, PDF en EPUB. De HTML\r\nuitvoer produceert een complete website. Deze HTML uitvoer wordt na elke\r\nwijziging geupload naar een repository op Github en van daaruit vervolgens\r\nautomatisch gepubliceerd op Netlify, een statische website\r\ngenerator. Zowel Github als Netlify zijn gratis te gebruiken.\r\nWanneer je nooit met DITA dan wel XML gewerkt heb, kan ik je deze\r\nroute niet aanbevelen. De drempel voor gebruik is nogal hoog. Verder is\r\nhet werken met formules en wiskundige symbolen niet altijd even\r\ngemakkelijk.\r\n(R)Markdown gebaseerd\r\nDoordat ik me steeds meer voor data-analyse (en dus de bijbehorende\r\nstatistiek) ben gaan interesseren ben ik een paar jaar geleden begonnen\r\nmet de programmeertaal R. Rapportages van analyses en\r\nonderzoeken worden gemaakt in de eenvoudige opmaaktaal Markdown en een wat\r\nuitgebreider formaat [RMarkdown](https://rmarkdown.rstudio.com/. Markdown is eenvoudig te\r\nleren, is platte tekst en kun je met bijvoorbeeld Notepad maken. Er zijn\r\nook wel gratis editors te vinden. Voor het werken met wiskundige\r\nsymbolen werk je met Latex code, dat goed ondersteund wordt. Ook goed\r\nondersteund wordt het werken met bibliografieën.\r\nEen bijkomend voordeel van deze platte tekst formaten is dat je\r\nuitstekend met versiebeheer zoals Git) kunt werken, al dan niet in\r\nteamverband.\r\nAls auteursomgeving voor R, Markdown en RMarkdown gebruik ik RStudio dat je gratis kunt downloaden en\r\ngebruiken. RStudio heeft ook vrij te gebruiken packages (een\r\nsoort bibliotheken) uitgebracht waaronder bookdown en\r\nblogdown waarmee je respectievelijk een boek / website\r\nkunt produceren. Bookdown kent naast latex/pdf ook\r\nhtml gebaseerde uitvoer zoals gitbook en tufte\r\nstijl. Het gitbook formaat gebruik ik nu voor de nieuwe online\r\nboeken. Tufte stijl spreekt me nog meer aan, maar daar moet ik me nog\r\nwat meer in verdiepen.\r\nDe gitbook uitvoer kun je dan weer publiceren op een webserver. Je\r\nkunt bookdown en blogdown gebruiken zonder kennis van R programmeren.\r\nIndien wenselijk zijn workflowprocessen goed te automatiseren.\r\nNatuurlijk moet je in het werken met markdown, rstudio, bookdown ook\r\nwel tijd investeren, maar veel minder dan in de XML wereld en ook de\r\ndrempels zijn veel lager en software is gratis, vaak open source.\r\nVoor wat voorbeelden van bookdown zie https://bookdown.org/home/archive/ Bij veel van deze\r\nboeken (niet allemaal) kom je op de online versie terecht wanneer je op\r\nhet boek klikt. Erg fraai vind ik https://www-huber.embl.de/msmb/ op tufte-stijl\r\ngebaseerd.\r\nAndere formaten\r\nMet een programma als Microsoft Word heb ik wel pdf’s geproduceerd,\r\nmaar nooit een online boek.\r\nOm documenten te converteren van een aantal verschillende\r\nopmaakindelingen naar vele andere indelingen kun je het gratis Pandoc gebruiken. Bij de\r\ninstallatie van RStudio is Pandoc inbegrepen omdat rmarkdown hier\r\ngebruik van maakt.\r\n\r\n\r\n\r\n",
    "preview": "posts/2019-11-03-online-studieboeken/preview.png",
    "last_modified": "2022-06-08T10:09:54+02:00",
    "input_file": {},
    "preview_width": 339,
    "preview_height": 228
  },
  {
    "path": "posts/2019-08-06-marktwaarde-voetbalclub/",
    "title": "Marktwaarde voetbalclub",
    "description": "Het bepalen van de marktwaarde van voetbalspelers met behulp van een webquery.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2019-08-06",
    "categories": [
      "excel",
      "powerquery"
    ],
    "contents": "\r\n\r\nContents\r\nGegevens\r\nophalen\r\nGeboortedatum\r\nMarktwaarde\r\nLaden in\r\nExcel\r\n\r\nAfgelopen zaterdag was ik bij de openingswedstrijd van FC Twente voor\r\nhet seizoen 2019/2020. Veel nieuwe spelers gezien en op de terugweg naar\r\nhuis was ik benieuwd naar de marktwaarde van de huidige selectie en\r\ntoekomstige wijzigingen daarin. Het Duitse bedrijf Transfermarkt\r\npubliceert veel data over clubs en spelers, waaronder ook hun\r\ninschatting van de marktwaarde van de spelers. Naast een algemene url\r\nheeft het bedrijf ook landspecifieke urls’s:\r\nAlgemeen: https://www.transfermarkt.com/\r\nDuitsland: https://www.transfermarkt.de/\r\nNederland: https://www.transfermarkt.nl/\r\n…\r\nOm analyses met Excel uit te kunnen voeren moet je de gegevens eerst\r\nin een werkblad in een geschikt formaat beschikbaar hebben. Een leuke\r\nuitdaging met behulp van Power Query. In de stappen hierna zie je hoe ik\r\ndat voor FC Twente heb uitgevoerd, maar je kunt het natuurlijk ook voor\r\njouw eigen favoriete club uitvoeren. De enige aanpassing is dan de url\r\nvan de club.\r\nWanneer je Nederlandse url van Transfermarkt gebruikt is het land\r\nNederland al voor je geselecteerd. Daarna kies je als\r\ncompetitie de Eredivisie en vervolgens de club, in\r\nmijn voorbeeld dus FC Twente. Klikken op de knop\r\n>> achter de clubnaam brengt je naar de\r\nclubpagina. Het eerste tabblad Compact bevat de gezochte\r\ninformatie: Spelersnaam, Geboortedatum, nationaliteit, Contractduur en\r\nMarktwaarde. Noteer de URL van deze pagina, in mijn geval https://www.transfermarkt.nl/jumplist/startseite/verein/317\r\nNu je de URL gevonden hebt kun je de browser sluiten, Excel\r\nopstarten,een lege werkmap openen en een query maken om de informatie op\r\nte halen en te bewerken.\r\nGegevens ophalen\r\nKies Gegevens > Van het web. Voer de genoteerde\r\nURL in en klik OK. Na even wachten verschijnt het venster Navigator met\r\nin de linkerkant de mogelijke tabellen. Je moet nu uitzoeken in welke\r\ntabel de gezochte informatie zit. Wanneer je een tabel selecteert krijg\r\nje in het rechterdeel een voorbeeld van de gegevens te zien. Je hoeft\r\nniet lang te zoeken want de eerste tabel Table 0 is al de goede\r\ntabel.\r\n\r\nKlik op Gegevens transformeren. Power Query Editor\r\nwordt opgestart met daarin de gegevens.\r\n\r\nVerwijder de eerste twee kolommen. Hernoem de kolom met de namen van\r\nde spelers in “Speler”. Wijzig de naam van de query in\r\n“Voetbalclub”.\r\n\r\nDe inhoud van de kolommen Geb./leeftijd en\r\nMarktwaarde is niet zodanig dat je er in Excel goed mee kunt\r\nwerken. Een geboortedatum willen we in de vorm “16-11-1996”. De leeftijd\r\nis geen vast kenmerk, maar een berekend gegeven en moet verwijderd\r\nworden. En voor de marktwaarde moet alleen een getal komen. Voor dit\r\nherstructureren van gegevens leent Power Query zich uitstekend.\r\nGeboortedatum\r\nWanneer je de gegevens in de kolom Geb./leeftijd bekijkt dan\r\nzie dat dag, maand, jaartal en leeftijd steeds van elkaar gescheiden\r\nworden door een spatie. Dat betekent dat je de inhoud van deze kolom\r\nkunt splitsen en over vier nieuwe kolommen kunt verdelen.\r\nSelecteer kolom Geb./leeftijd. Kies tab\r\nTransformeren > Kolom splitsen (groep Kolom Tekst) > Op\r\nscheidingsteken. Selecteer de spatie als\r\nscheidingsteken en ook dat er op elke spatie gesplitst moet worden.\r\n\r\nKlik op OK. De oude kolom is nu verdwenen en er zijn\r\nvier nieuwe kolommen voor terug gekomen. Verwijder de laatste hiervan,\r\ndie waarin de leeftijden als negatieve getallen staan. Wijzig de naam\r\nvan de andere drie kolommen in resp. dag, maand en\r\njaar.\r\nAchter de maandnaam staat een punt. Deze moet verwijderd worden\r\nanders kunnen de datumfuncties van Excel er niet mee overweg. Selecteer\r\nde kolom maand. Kies tab Transformeren > Waarden\r\nvervangen (groep Alle kolommen).Specificeer voor de te zoeken\r\nwaarde een punt en laat het vakje voor de te vervangen waarde\r\nleeg. Klik OK.\r\nNu moet er uit dag, maand en jaar een nieuwe kolom met de\r\ngeboortedata gemaakt worden. Kies tab Kolom toevoegen >\r\nAangepaste kolom. Noem de nieuwe kolom “Geboortedatum” en voer\r\nde volgende formule in:\r\n= Text.From([dag]) & \"-\" & [maand] & \"-\" & Text.From([jaar])\r\n\r\nKlik op OK. Het gegevenstype van deze kolom moet nog\r\nop Datum gezet worden. Met de kolom Geboortedatum nog geselecteerd kies\r\nje tab Startpagina > Gegevenstype (groep Transformeren) >\r\nDatum. Verwijder daarna de overbodige kolommen dag,\r\nmaand en jaar.\r\n\r\nMarktwaarde\r\nDe gegevens in de kolom Marktwaarde eindigen allemaal met\r\n. €. Dit moet eerst verwijderd worden.\r\nSelecteer de kolom Marktwaarde. Kies tab\r\nTransformeren > Waarden vervangen (groep Alle\r\nkolommen).Specificeer voor de te zoeken waarde . €\r\nen laat het vakje voor de te vervangen waarde leeg. Klik\r\nOK.\r\nDe inhoud van de kolom Marktwaarde bestaat nu uit een getal en een\r\ntekstaanduiding voor de eenheid, welke van elkaar gescheiden zijn door\r\neen spatie. Ga op dezelfde manier als bij geboortedatum te werk om deze\r\nkolom te splitsen op de spatie. De oude kolom wordt hierdoor vervangen\r\ndoor twee nieuwe kolommen: Marktwaarde.1 met het getal en\r\nMarktwaarde.2 met de eenheid.\r\nDe tekst van deze eenheid ga je nu vervangen door het overeenkomstige\r\ngetal. Selecteer kolom Marktwaarde.2. Vervang nu de waarde\r\ndzd door 1000 en daarna de waarde\r\nmln door 1000000. Wijzig daarna het\r\ngegevenstype van deze kolom in Geheel getal.\r\nNu kan er een nieuwe kolom Marktwaarde door de inhoud van de\r\ntwee kolommen met elkaar te vermenigvuldigen. Kies tab Kolom\r\ntoevoegen > Aangepaste kolom. Noem de nieuwe kolom\r\nMarktwaarde en voer de volgende formule in:\r\n= [Marktwaarde.1]*[Marktwaarde.2]\r\n\r\nKlik op OK. Wijzig het gegevenstype van deze kolom\r\nin Valuta. Verwijder vervolgens de overbodig geworden kolommen\r\nMarktwaarde.1 en Marktwaarde.2.\r\nLaden in Excel\r\nDe query is nu klaar en de gegevens kunnen in een Excel werkblad\r\ngeladen worden. Kies tab Startpagina > Sluiten en\r\nladen.\r\nMaak in het Excel werkblad de inhoud van Marktwaarde op als Valuta\r\nzonder decimalen.\r\nVoeg tot slot een totaalrij toe via tab Tabelontwerp >\r\naanvinken Totaalrij (groep Opties voor tabelstijlen).\r\n\r\nWanneer de marktwaarde van een speler wijzigt, er spelers vertrekken\r\nof bijkomen, hoef je alleen maar de query te vernieuwen via tab\r\nGegevens > Alles vernieuwen (groep Query’s en\r\nverbindingen).\r\n|Merk verder op dat bij twee spelers geen nationaliteit vermeld is.\r\nOnderzoek van de brondata laat zien dat deze twee spelers een dubbele\r\nnationaliteit hebben. Blijkbaar kan de query daar niet mee overweg.\r\n\r\n\r\n\r\n",
    "preview": "posts/2019-08-06-marktwaarde-voetbalclub/club-08.png",
    "last_modified": "2022-06-08T10:10:22+02:00",
    "input_file": {},
    "preview_width": 479,
    "preview_height": 587
  },
  {
    "path": "posts/2019-07-31-excel-functienamen-vertalen/",
    "title": "Functienamen van Excel vertalen",
    "description": "Addin voor Excel om functienamen te vertalen.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2019-07-31",
    "categories": [
      "excel"
    ],
    "contents": "\r\nVeel van de Excel blogs die ik lees zijn Engelstalig. Af en toe komt\r\nhet voor dat ik van een Engelstalige formule de Nederlandse vertaling\r\nniet ken. Dan wordt het uitproberen of ik zoek op het web de vertaling\r\nop. Kort geleden ontdekte ik dat Microsoft hiervoor een add-in heeft,\r\ngenaamd Functievertaler, zie het artikel Functievertaler\r\nvan Excel\r\nFunctiesvertalerDe installatie voor Excel 365 verliep iets anders dan aangegeven:\r\nExcel opstarten > tab Invoegen > Invoegtoepassingen\r\ndownloaden > Functions translator intypen in het zoekvak >\r\nSelecteren > Toevoegen\r\nDe add-in werkt erg handig en ik gebruik deze nu ook omgekeerd van\r\nhet Nederlands naar het Engels.\r\n\r\n\r\n\r\n",
    "preview": "posts/2019-07-31-excel-functienamen-vertalen/preview.png",
    "last_modified": "2022-06-08T10:10:44+02:00",
    "input_file": {},
    "preview_width": 293,
    "preview_height": 246
  },
  {
    "path": "posts/2019-07-15-power-bi-desktop-2/",
    "title": "Power BI Desktop (deel 2)",
    "description": "Het tweede deel van de tutorial over Power BI Desktop. Meer visualisaties en eindrapportage.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2019-07-15",
    "categories": [
      "excel",
      "power-bi",
      "tutorial"
    ],
    "contents": "\r\n\r\nContents\r\nVisualisatie:\r\nVerkochte aantallen per plaats per categorie\r\nInteractiviteit tussen\r\ngrafieken\r\n\r\nVisualisatie: Omzet per\r\nboek\r\nVisualisatie: Totale omzet\r\nVisualisatie: Filter op\r\nprijsklasse\r\nTitel\r\nRapport\r\nEindrapport\r\nOpslaan\r\n\r\nIn het deel 1 van deze tutorial heb je kennis gemaakt met Power BI\r\nDesktop, een gegevensbestand ingeladen en een eerste visualisatie\r\ngemaakt. Het resulaat heb je als een Power BI bestand bewaard onder de\r\nnaam powerbi-desktop-1.pbix. In dit artikel gaan we hiermee\r\nverder, maken een berekende kolom en voegen een paar meer visualisaties\r\ntoe.\r\nStart Power BI Desktop op en laad het bestand powerbi-desktop-1.pbix\r\nin. Wanneer je niet meer de beschikking over dit bestand hebt kun je het\r\nook hier\r\ndownloaden.\r\nVisualisatie:\r\nVerkochte aantallen per plaats per categorie\r\nIn de tabel tblVerkopen zijn van elk boek de verkochte\r\naantallen per plaats bijgehouden. En in de tabel tblBoeken\r\nkun je zien tot welke categorie een boek behoort. Interessant is nu om\r\nte weten welke categorie in welke plaats het meest populair is. Hiervoor\r\nis het grafiektype Treemap zeer geschikt, welke een\r\nhiërarchische weergave van de gegevens biedt, waardoor het relatief\r\neenvoudig is om patronen te herkennen.\r\nOm een nieuwe visualisatie in het canvas op te nemen moet je\r\nallereerst er voor zorgen dat geen bestaande visualisatie geselecteerd\r\nis. Klik nu op visualisatie Treemap.\r\nvisualisatie TreemapEr wordt nu een treemap zonder inhoud in het canvas geplaatst. Sleep\r\nnu het veld hoeveelheid uit tabel tblVerkopen\r\nin de treemap. Er wordt nu 1 rechthoek gemaakt voor de totale\r\nhoeveelheid. Sleep vervolgens veld plaats uit tabel\r\ntblVerkopen in de treemap. Je krijgt nu via drie\r\nrechthoeken de hoeveelheid per plaats te zien.\r\nHoeveelheid per plaatsSleep vervolgens veld categorie uit tabel\r\ntblBoeken in de treemap. De grote rechthoek voor een plaats\r\nwordt nu opgedeeld in kleinere rechthoeken, 1 voor elke categorie. Om de\r\nnamen van alle categorieën goed te zien moet je de treemap wat breder\r\nmaken door aan de handgrepen aan de zijkanten te slepen.\r\nHoeveelheid per plaatsDuidelijk is te zien dat in alledrie de plaatsen de categorie Reizen\r\nde meest verkochte boeken heeft\r\nIn het deelvenster Visualisaties kun je ook zien welke velden\r\ngebruikt zijn voorGroep, Details en Waarden.\r\nGebruikte veldenIn plaats van de velden in de treemap te slepen kun je ze ook naar\r\ndeze lokaties slepen.\r\nInteractiviteit tussen\r\ngrafieken\r\nDe visualisaties in het rapport zijn interactief. Je kunt ze\r\ngebruiken om te filteren. Wanneer je bijvoorbeeld in de treemap binnen\r\nde plaats Enschede op de categorie Reizen klikt, dan zie je in de andere\r\ngrafiek met de gegroepeerde kolommen de titels die in deze categorie\r\nvallen.\r\n\r\nEn zo kun je ook in de kolomgrafiek op een boektitel klikken waardoor\r\nin de treemap een bijbehorend blokje getoond wordt.\r\n\r\nOm de filtering ongedaan te maken klik je in de grafiek opnieuw op\r\nhet item dat voor de filtering zorgt.\r\nGeef tot slot de titel van de treemap een gelijke opmaak als de\r\neerste grafiek.\r\nVisualisatie: Omzet per boek\r\nOm de omzet per boek in een grafiek weer te geven moet de omzet eerst\r\nberekend worden. Dat kan door een nieuwe kolom te maken waarin de velden\r\nprijs en hoeveelheid met elkaar\r\nvermenigvuldigd worden.\r\nSchakel via de knop in het linker zijpaneel over naar de weergave\r\nGegevens en selecteer dan in het rechter deelvenster de tabel\r\ntblVerkoop.\r\nKies dan in het menu tab Model maken -> Nieuwe kolom (groep\r\nBerekeningen).\r\nEr wordt nu een nieuwe kolom aan de tabel toegevoegd en ook wordt een\r\nformulebalk zichtbaar met daarin de tekst Kolom =. Deze\r\nformulebalk lijkt op die in Excel, maar je kunt echter geen Excel\r\nformules gebruiken.\r\nPower BI gebruikt een eigen formuletaal DAX geheten,\r\nwat staat voor Data Analysis eXpression. Je kunt een formule helemaal\r\nhandmatig intypen, maar je kunt ook gebruik maken van\r\nIntellisense. Dit is een hulpmiddel dat bij het\r\ninvoeren van een formule verschijnt. Tijdens het intypen wordt een lijst\r\nmet namen van mogelijke functies, variabelen en eigenschappen getoond.\r\nDoor op een onderdeel in de lijst te selecteren en dan op de TAB toets\r\nte drukken wordt het geselecteerde in de formule geplaatst. Je kunt ook\r\ndubbelklikken op de naam van het onderdeel.\r\nBegin de formule met Omzet =\r\nHierna moet de veldnaam hoeveelheid uit de tabel\r\ntblVerkopen komen. Begin met het intypen van de beginletter\r\nh. Zodra je dat gedaan hebt worden er voorstellen\r\ngetoond:\r\n\r\nBij lange lijsten is het aan te raden wat meer van de naam in te\r\ntypen. De lijst wordt dan steeds kleiner waardoor het selecteren van het\r\njuiste item steeds gemakkelijker wordt.\r\nIn dit geval is de lijst klein en is het juiste onderdeel al\r\nzichtbaar. Dat is tblVerkopen[hoeveelheid]. Voeg deze aan\r\nde formule toe, zodat er komt te staan\r\nOmzet = tblVerkopen[hoeveelheid].\r\nDe syntax in DAX is steeds tabelnaam[veldnaam].\r\nNu moet er nog vermenigvuldigd worden met het veld\r\nprijs.\r\nBegin met het intypen van *pr. Echter nu toont\r\nintellisense niet het onderdeel dat toegevoegd moet worden. In zijn\r\nalgemeenheid betekent dit ook dat je een fout maakt, dat je het zo niet\r\nin kunt voeren. De reden dat het juiste veld niet getoond wordt is dat\r\nhet veld prijs niet in de geselecteerde tabel\r\ntblVerkopen zit, maar in de tabel tblBoeken.\r\nGelukkig is deze tabel gerelateerd aan de tabel\r\ntblVerkopen. Door gebruik te maken van de DAX functie\r\nRELATED kun je een veld uit een gerelateerde tabel\r\ntoevoegen.\r\nVerwijder het ingetypte pr en hervat het intypen met\r\nre. Nu wordt de functie RELATED zichtbaar.\r\nVoeg deze aan de formule toe. Er wordt dan een lange lijst met functies\r\nuit de gerelateerde tabellen zichtbaar. Je kunt het gewenste veld in\r\ndeze lijst opzoeken, maar het is handiger om de eerste letter(s) van de\r\nveldnaam in te typen.\r\nTyp een p in. Nu wordt maar één veld getoond en dat is\r\nde gezochte tblBoeken[prijs]. Voeg deze aan de formule\r\ntoe.\r\nDe formule is nu\r\nOmzet = tblVerkopen[hoeveelheid]*tblBoeken[prijs]. De\r\nformule is hiermee klaar. Sluit af met de ENTER toets.\r\nDe berekende waarden verschijnen in de nieuwe kolom die ook gelijk de\r\nnaam Omzet krijgt.\r\nNieuwe kolom OmzetOm het nog wat te verfraaien ga je de bedragen opmaken in de euro\r\nnotatie.\r\nDe opmaak van een geselecteerde kolom kun je via tab Model\r\nmaken op het lint vinden. De huidige opmaak is de notatie\r\nAlgemeen.\r\n\r\nVerander via de keuzelijst de notatie in Euro.\r\n\r\nNu er een veld voor omzet is kan een grafiek voor de omzet per boek\r\ngemaakt worden.\r\nSchakel over naar de indeling Rapport. Zorg er voor dat geen\r\nvisualisatie in het canvas geselecteerd is. Sleep nu het veld\r\nOmzet uit de tabel tblVerkopen naar een lege\r\nplek in het canvas. Sleep daarna het veld Titel uit de\r\ntabel tblBoeken in de nieuwe visualisatie. Pas de titel aan\r\nop overeenkomstige wijze als bij de twee andere grafieken.\r\nOmzet per titelVisualisatie: Totale omzet\r\nWanneer je slechts één waarde (getal, tekst) wilt weergeven dan is de\r\nvisualisatie Kaart een goede keuze.\r\nvisualisatie KaartKlik op de visualisatie Kaart zodat deze aan het canvas toegevoegd\r\nwordt. Sleep daarna het veld Omzet uit de\r\ntblVerkopen in de visualisatie.\r\nDe totale omzet is € 74.748,95. Echter deze waarde wordt standaard\r\nweergegeven als duizendtallen, in dit geval dus als € 74,75K. De\r\nweergave-eenheid kun je als volgt wijzigen.\r\nKlik in het deelvenster Visualisatie op de tab\r\nIndeling (afgebeeld als een verfroller). Klap\r\nGegevenslabel open. Kies dan bij * weergave-eenheden\r\nvoor Geen. Schakel verder de weergave van het\r\ncategorielabel uit.\r\nMaak een titel met de tekst “Totale omzet” en pas deze op\r\novereenkomstige wijze als bij de andere grafieken.\r\nVisualisatie: Filter op\r\nprijsklasse\r\nFiteren op basis van getallen (en ook datums) kan goed met een\r\nzogeheten Slicer (afbeelding met trechter).\r\nvisualisatie SlicerVoeg een slicer aan het canvas toe en sleep hierin het veld\r\nprijs uit de tabel tblBoeken. Geef deze\r\nvisualisatie een titel met de tekst “Filter op prijsklasse” en geef deze\r\ndezelfde opmaak als de andere visualisaties.\r\nExperimenteer met de grenswaarden van de slicer en let op de\r\ninteracties met de andere visualisaties. Om de selecties te wissen kun\r\nje op de daarvoor bestemde knop in de rechterbovenhoek van de slicer\r\nklikken:\r\nSlicer selecties wissenTitel Rapport\r\nEen mooi rapport hoort een titel met een logo te hebben. Maak aan de\r\nbovenkant van het canvas wat ruimte voor een logo en een titel door de\r\nandere visualisaties wat te verschuiven.\r\nEen afbeelding en een tekst kun je toevoegen via het menu\r\nStartpagina -> Afbeelding (respectievelijk Tekstvak).\r\n\r\nHet door mij gebruikte logo kun je hier vinden.\r\n\r\nEindrapport\r\nJe kunt nu de visualisaties nog wat verschuiven of de afmetingen wat\r\naanpassen zodat het er wat gelikter uitziet. Een voorbeeld:\r\nEindrapport Verkoop BoekenOpslaan\r\nSla het bestand op onder de naam\r\npowerbi-desktop-2.pbix.\r\n\r\n\r\n\r\n",
    "preview": "posts/2019-07-15-power-bi-desktop-2/boekenverkoop-eindrapport.png",
    "last_modified": "2022-06-08T10:12:04+02:00",
    "input_file": {},
    "preview_width": 540,
    "preview_height": 387
  },
  {
    "path": "posts/2019-07-14-power-bi-desktop-1/",
    "title": "Power BI Desktop (deel 1)",
    "description": "Het eerste deel van een tutorial over het werken met Power BI Desktop. Het ophalen van gegevens en het maken van een visualisatie.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2019-07-14",
    "categories": [
      "excel",
      "power-bi",
      "tutorial"
    ],
    "contents": "\r\n\r\nContents\r\nGegevens\r\nophalen\r\nVisualisatie:\r\nVerkochte hoeveelheid per titel\r\nOpmaak\r\nwijzigen\r\n\r\nOpslaan\r\n\r\nMet de mogelijkheden van de laatste versies van Excel ben je goed in\r\nstaat om gegevens te analyseren en te visualiseren. Maar daarnaast heeft\r\nMicrosoft hiervoor nog een andere applicatie, namelijk Power\r\nBI. Er zijn overeenkomsten en verschillen tussen Excel en Power\r\nBI. Aan Excel is al veel aandacht besteed, zie de gratis online cursus\r\nLeerExcel. In een tweetal\r\nartikelen wil ik je bekend laten maken met Power BI.\r\nMicrosoft Power BI bevat drie componenten, die je ook in Excel\r\naantreft:\r\nPower Query, waarmee je verbindingen maakt met\r\ngegevensbronnen en de gegevens kunt bewerken.\r\nPower Pivot, waarmee je het gegevensmodel kunt\r\ninstellen (relaties aanbrengen) en berekende kolommen en metingen\r\n(measures) kunt maken.\r\nPower View, waarmee je de gegevens kunt\r\nvisualiseren in de vorm van grafieken en andere elementen.\r\nPower BI componentenWanneer je met Microsoft Power BI wilt werken heb je twee\r\nmogelijkheden.\r\nPower BI service: een cloud gebaseerde online service\r\nPower BI desktop: een applicatie op de lokale computer\r\nMet beide kun je gratis werken. In deze tutorial vind je een\r\nkennismaking met de laatste. Om de oefeningen uit te voeren moet je\r\nuiteraard Power BI geïnstalleerd hebben. Dat kan via de link https://powerbi.microsoft.com/desktop. Je hebt wel een\r\nMicrosoft account nodig.\r\nVerder heb je het hulpbestand boekenverkoop.xlsx nodig dat\r\nje via deze website hier kunt\r\ndownloaden. Dit is een klein bestand met gegevens over de verkoop van\r\nboeken.\r\nGegevens ophalen\r\nStart Power BI Desktop op. Je krijgt nu het volgende scherm:\r\nPower BI opstartschermKies aan de linkerkant van dit opstartscherm voor Gegevens\r\nophalen. Kies daarna in het scherm dat verschijnt voor\r\nExcel. Klik daarna op de knop Verbinding maken en\r\nblader dan naar het bestand boekenverkoop.xlsx. Klik op\r\nOpenen. Het venster Navigator verschijnt dan.\r\nNavigator vensterHet navigatievenster is een plaats waar je een voorbeeld van de\r\ngegevens van alle gegevensentiteiten in de gegevensbron kunt bekijken.\r\nHet excelbestand waar je nu verbinding mee maakt heeft drie werkbladen\r\n(Auteurs, Boeken, Verkopen). En elk van deze werkbladen bevat een tabel\r\nmet gegevens (tblAuteurs, tblBoeken, tblVerkopen). Wanneer je een\r\nwerkblad of tabel selecteert krijg je aan de rechterkant een voorbeeld\r\nvan deze gegevens te zien. Omdat elk werkblad alleen maar één tabel\r\nbevat, maakt het niet uit of je een tabel of een werkblad\r\nselecteert.\r\nSelecteer de drie tabellen en klik dan op de knop Laden.\r\nPower BI laad nu de gegevens in het geheugen en probeert tevens\r\nrelaties te leggen tussen de tabellen. Voordat je nu verder gaat moet je\r\neerst controleren of er relaties aangebracht zijn en zoja of deze juist\r\nzijn. Zo niet dan zul je zelf de relaties moeten aanbrengen dan wel\r\ncorrigeren.\r\nAan de linkerkant van het scherm zitten drie knoppen waarmee je kunt\r\nschakelen tussen de weergaves.\r\nPower BI weergavesKlik op de knop Model.\r\nRelaties tussen de drie\r\ntabellenDe automatisch gelegde relaties zijn bij dit voorbeeld juist:\r\nTussen tblAuteurs en tblBoeken zit een 1\r\nop veel relatie via het veld auteur-id.\r\nTussen tblBoeken en tblVerkopen zit een 1\r\nop veel relatie via het veld isbn.\r\nNu het gegevensmodel in orde is kun je verder gaan met het maken van\r\nvisualisaties voor een rapport.\r\nKlik aan de linkerkant van het scherm op de knop\r\nRapport.\r\nNa het laden van de gegevens zie je in de rapportweergave aan de\r\nrechterkant van het scherm in het deelvenster Velden een lijst met de\r\ntabellen. Met de pijltjes omlaag kun je een tabel openklappen waarna de\r\nvelden zichtbaar worden. Je gaat nu de eerste grafiek te maken.\r\nVisualisatie:\r\nVerkochte hoeveelheid per titel\r\nSleep het veld hoeveelheid uit de tabel\r\ntblVerkopen naar het grote lege canvas.\r\nVeld hoeveelheid in canvas\r\nslepenDeze actie creeert één visualisatie. De default visualisatie is een\r\ngegroepeerd kolomdiagram. In dit geval wordt er maar 1 kolom getekend\r\nwelke het totaal aantal verkochte boeken weergeeft. Wanneer je de muis\r\nop de kolom plaatst zie dat het totale aantal 3592 is.\r\nTotaal aantal verkochte\r\nboekenAan de handgrepen om de figuur kun je zien dat deze visualisatie nog\r\nsteeds geselecteerd is.\r\nOm de verkochte aantallen per boek te zien moet je het veld\r\ntitel uit de tabel tblBoeken in dezelfde\r\nvisualisatie slepen.\r\nHoeveelheid per titelDe titel van het boek is langs de X-as geplaatst en de verkochte\r\nhoeveelheid langs de Y-as. Desgewenst kun je via de handgrepen de\r\nafmetingen wijzigen.\r\nOpmaak wijzigen\r\nIn het deelvenster Visualisaties zitten drie tabs waarmee je diverse\r\ninstellingen voor de geselecteerde visualisatie kunt wijzigen. Met de\r\nmiddelste die de vorm van een verfroller heeft, kun je allerlei\r\nopmaakkenmerken instellen.\r\nVisualisatie tabsZorg dat de grafiek geselecteerd is en selecteer daarna de tab\r\nIndeling.\r\nAllereerst ga je de kleuren van de kolommen wijzigen. Klap\r\nGegevenskleuren uit en stel daarna de standaardkleur in op\r\nrood.\r\nGegevenskleur ingesteld op\r\nroodOm ook het aantal verkochte boeken als een getal bij de kolom te\r\nplaatsen moet je de optie Gegevenslabels inschakelen.\r\nGegevenslabels ingeschakeldTot slot wordt de titel gewijzigd.\r\nKlap opmaak voor Titel open en breng de volgende wijzigingen\r\naan:\r\nTiteltekst: Aantal verkocht per titel\r\nTekenkleur: zwart\r\nUitlijning: gecentreerd\r\nAchtergrondkleur: grijs\r\nTekengrootte: 10 pt\r\nOpmaak titelOpslaan\r\nPower BI bestanden hebben standaard de extensie .pbix. Kies voor\r\nBestand opslaan en bewaar het bestand onder de naam\r\n‘powerbi-desktop-1.pbix’.\r\nIn een volgend artikel zal het maken van een paar andere\r\nvisualisaties uitgelegd worden.\r\n\r\n\r\n\r\n",
    "preview": "posts/2019-07-14-power-bi-desktop-1/powerbi-opstartscherm.png",
    "last_modified": "2022-06-08T10:11:44+02:00",
    "input_file": {},
    "preview_width": 530,
    "preview_height": 289
  },
  {
    "path": "posts/2018-11-18-power-query-opties/",
    "title": "Power Query Opties",
    "description": "Opties voor Power Query in Excel.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2018-11-18",
    "categories": [
      "excel",
      "powerquery"
    ],
    "contents": "\r\nHet gegevensmodel werd voor het eerst geïntroduceerd in\r\nExcel 2010 samen met de Power Pivot addin. Vanaf versie 2013 is\r\nhet gegevensmodel volledig opgenomen in Excel. Een gegevensmodel is een\r\nabstract model dat gegevens in tabellen organiseert en relaties tussen\r\ntabellen mogelijk maakt.\r\nVia Gegevens ophalen, voorheen Power Query genoemd,\r\nkun je gegevens uit meerdere gegevensbronnen in Excel laden. Aan het\r\neinde van het importproces heb je de keuze om de gegevens naar een\r\nwerkblad, het gegevensmodel of beide te laden.\r\nNiet altijd heb je deze keuze en dat wordt veroorzaakt door de\r\nstandaardinstellingen voor het laden van query’s. Deze\r\nstandaardinstellingen zijn op twee manieren te bereiken:\r\nIn Excel: tab Gegevens > Gegevens ophalen (groep gegevens ophalen\r\nen transformeren) > Queryopties\r\nIn Power Query Editor: Bestand > Opties en instellingen >\r\nQueryopties\r\nIn beide gevallen krijg je\r\nPower Query OptiesMet de standaardinstellingen voor het laden worden de gegevens naar\r\neen nieuw werkblad geladen als er één query wordt geladen. Wanneer je\r\ntwee of meer tabellen importeert wordt automatisch een gegevensmodel\r\ngemaakt. Je kunt het dialoogvenster Laden naar gebruiken om deze\r\ninstellingen voor een bepaalde query te overschrijven.\r\n\r\n\r\n\r\n",
    "preview": "posts/2018-11-18-power-query-opties/power-query-opties.png",
    "last_modified": "2022-06-08T10:12:36+02:00",
    "input_file": {},
    "preview_width": 528,
    "preview_height": 386
  },
  {
    "path": "posts/2018-10-19-power-pivot/",
    "title": "Power Pivot voor alle Windows Excel versies",
    "description": "Beschikbaarheid van Power Pivot nu voor alle versies van Excel.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2018-10-19",
    "categories": [
      "excel",
      "powerpivot"
    ],
    "contents": "\r\nToen Office 2016 voor het eerste beschikbaar kwam (september 2015)\r\nwas het voor mij (en vele andere gebruikers) teleurstellend dat Power\r\nPivot slechts in beperkte versies van Excel 2016 beschikbaar was.\r\nGebruikers van Excel 2010 en Excel 2013 konden tot dan een gratis Power\r\nPivot add-in installeren, maar met het uitkomen van Excel 2016 werd\r\nPower Pivot voor de zakelijke markt gepositioneerd. En het treurige was\r\ndat je dit pas ontdekte nadat je het product gekocht had, zoals ik met\r\nmijn Office 365 Home abonnement dat een volledig werkende versie van\r\nExcel zou bevatten.\r\nGelukkig is Microsoft dit voorjaar van\r\ngedachten veranderd en wordt Power Pivot voor alle Windows versies\r\nvan Excel beschikbaar gesteld. Het uitrollen hiervan is gestart via de\r\nmaandelijkse updates vanaf mei 2018 (Build 9330 en daarna). Na het\r\nontvangen van de update moet je deze COM-invoegtoepassing nog wel\r\nactiveren via Invoegtoepassingen in Excel Opties. Daarna verschijnt\r\nPower Pivot op het lint.\r\n\r\n\r\n\r\n",
    "preview": "posts/2018-10-19-power-pivot/preview.png",
    "last_modified": "2022-06-08T10:13:03+02:00",
    "input_file": {},
    "preview_width": 461,
    "preview_height": 95
  },
  {
    "path": "posts/2018-09-09-website-bouwstenen-1/",
    "title": "Website bouwstenen (1)",
    "description": "Opsomming hulpprogramma's voor het maken van een statische website.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2018-09-09",
    "categories": [
      "markdown",
      "hugo"
    ],
    "contents": "\r\nDeze website is een zogenaamde statische website die door een\r\ngenerator uit een aantal brondocumenten is samengesteld. In dit eerste\r\ndeel een korte opsomming en beschrijving van de gebruikte hulpmiddelen\r\nen werkwijze.\r\nHulpmiddelen\r\nBlogdown, een R\r\npackage voor het maken van statische websites met Rmarkdown.\r\nRStudio, een geïntegreerde\r\nontwikkelomgeving voor de taal R.\r\nHugo, een populaire open-source\r\nstatische website generator.\r\nLearn, een\r\nthema voor Hugo\r\nGit, een versiebeheer\r\nsysteem.\r\nGitHub, een populaire hosting\r\nservice voor Git repositories.\r\nNetlify, een platform voor\r\nhet uitleveren van statische websites\r\nMarkdown\r\nen RMarkdown als\r\nopmaaktalen voor de brondocumenten\r\nMathJax, een javascript\r\nengine voor wiskundige expressies in browsers.\r\nGoogle Analytics, om het\r\ngebruik van de website te kunnen analyseren.\r\nWerkwijze\r\nR, RStudio en Git waren al geïnstalleerd. Een GitHub en Google\r\nAnalytics account was er ook al. In hoofdlijnen was de werkwijze\r\nInstallatie van package Blogdown via RStudio.\r\nEen nieuw RStudio project gemaakt voor deze website gebaseeerd op\r\nhugo-theme-docdock.\r\nVan de projectmap een Git repository gemaakt.\r\nDiverse aanpassingen voor structuur en layout gemaakt.\r\nNieuwe inhoud aangemaakt en een beperkt deel van de inhoud van de\r\noude website geconverteerd en in een archiefmap geplaatst.\r\nNa uitgebreid testen de website op de server geplaatst.\r\nIn een volgend artikel zal wat gedetailleerder op bepaalde\r\nonderdelen worden ingegaan.\r\n\r\n\r\n\r\n",
    "preview": "posts/2018-09-09-website-bouwstenen-1/preview.png",
    "last_modified": "2022-06-08T10:13:32+02:00",
    "input_file": {},
    "preview_width": 315,
    "preview_height": 111
  },
  {
    "path": "posts/2015-10-05-r-installatie/",
    "title": "R installatie",
    "description": "Hoe te beginnen met R.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2015-10-05",
    "categories": [
      "markdown",
      "R"
    ],
    "contents": "\r\nR is een (gratis) programmeertaal voor statistische berekeningen en\r\ndata-analyses en beschikbaar voor Windows, MacOS en Unix. Na installatie\r\nkrijg je een eenvoudige GUI met daarbinnen een console. Via de console\r\nkun je R opdrachten intypen en direct laten uitvoeren. Via de Gui kun je\r\neen bestand met R opdrachten maken (R-script), opslaan en uitvoeren.\r\nDoor de structuur van R is de software uitstekend te gebruiken voor\r\nhet uitvoeren van (reproduceerbaar) statistisch onderzoek waarmee je ook\r\nnog eens de rapporten en presentaties kunt genereren.\r\nR heeft wel een behoorlijke drempel om er mee te beginnen. Veel\r\nopdrachten kun je op zoveel manieren uitvoeren dat je snel de weg\r\nkwijtraakt. Gelukkig is er een grote, actieve community waar je hulp\r\nkunt krijgen. Ook zijn er erg veel boeken, tutorials en blogs waar je\r\nveel informatie kunt vinden.\r\nInstallatie R\r\nDe thuisbasis van het R project is https://www.r-project.org/. Downloaden van R kan op\r\n“Comprensive R Archive Network” CRAN. Daarna eenvoudig de\r\ninstallatie uitvoeren.\r\n\r\nEen andere optie het gebruik van Microsoft R Application Network MRAN\r\n\r\nR biedt na installatie een console waar R commando’s kunnen worden\r\ningegeven en het resultaat op het scherm weergegeven. Dit is een\r\nwerkbare methode, maar het is veel handiger en ook aan te raden om met\r\neen IDE als RStudio te gaan werken.\r\nEenvoudig voorbeeld\r\nHieronder een eenvoudig voorbeeld met vier opdrachten. Eerst worden\r\n1000 getallen random getrokken uit een normale verdeling met gemiddelde\r\n6,5 en een standaarddeviatie 1,5. Het resultaat wordt toegekend aan\r\nvariabele z. In R is dat een vector met in dit geval 1000\r\ngetallen. De opdracht summary geeft een\r\n5-getallensamenvatting van de waarden, waarna een (default) histogram en\r\neen (default) boxplot wordt getekend.\r\nz <- rnorm(n = 1000, mean = 6.5, sd = 1.5)\r\nsummary(z)\r\nhist(z)\r\nboxplot(z)\r\n\r\n   Min. 1st Qu.  Median    Mean 3rd Qu.    Max. \r\n  2.285   5.558   6.514   6.524   7.497  11.362 \r\n\r\n\r\nRStudio\r\nJe kunt met de standaard meegeleverde Gui werken, maar veel\r\nplezieriger en handiger is te werken met RStudio\r\nDesktop. RStudio is een geïntegreerde ontwikkelomgeving\r\n(IDE)voor R welke veel voordelen en extra’s biedt. De open source editie\r\nvan RStudio is gratis en ook hiervan zijn versies voor Windows, Mac en\r\nLinux. Wanneer je met R werkt kun je eigenlijk niet zonder. Download RStudio Desktop\r\nOpen Source Edition. Let er op dat je eerst R installeert voordat je\r\nRStudio installeert.\r\nR en Markdown\r\nEen R programma (extensie .R) is een plat tekstbestand\r\nmet R-code, een script dus. Met de opdracht source(bestand)\r\nwordt het bestand ingelezen en uitgevoerd. De uitvoer wordt standaard in\r\nde console getoond\r\nEen R Markdown bestand (extensie .Rmd) is een Markdown\r\nbestand waarin R code opgenomen kan worden. Hieruit kun je een document\r\nproduceren dat naast de opgemaakte markdown tekst ook de uitvoer van de\r\nR-code bevat, bijvoorbeeld een grafiek. Hierdoor is het overbodig\r\ngeworden om de resultaten eerst apart in R (of Excel) te laten\r\nproduceren om ze daarna samen te voegen met de teksten. RStudio heeft\r\nhier hulpmiddelen omheen gebouwd om de uitvoer in verschillende formaten\r\nte produceren, zoals HTML, PDF, EPUB, Word, … Hierdoor heb je de\r\nmogelijkheid om jouw analyses om te zetten in kwalitatief hoogwaardige\r\nrapporten, presentaties, dashboards, tijdschriftartikelen, … Zo is ook\r\ndit document als een .Rmd bestand gemaakt.\r\n\r\n\r\n\r\n",
    "preview": "posts/2015-10-05-r-installatie/Rlogo.png",
    "last_modified": "2022-06-08T10:13:54+02:00",
    "input_file": {},
    "preview_width": 200,
    "preview_height": 155
  },
  {
    "path": "posts/2012-12-24-eboek-lezen/",
    "title": "Het lezen van e-boeken",
    "description": "De mogelijkheden die je hebt om een e-boek te lezen hangen af van het formaat waarin het e-boek is uitgebracht, de apparatuur waarover je beschikt en of het e-boek al dan niet met DRM beschermd is.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2012-12-24",
    "categories": [
      "eboek"
    ],
    "contents": "\r\nE-boeken\r\nE-boeken die je moet kopen zijn vaak beveiligd met DRM (Digital\r\nRights Management), een systeem van Adobe. De beveiliging zorgt er voor\r\ndat je de e-boeken maar een beperkt aantal keren (4-5) op verschillende\r\napparaten kunt installeren.\r\nBen je nog helemaal niet bekend met het fenomeen e-reader, e-boek en\r\ndigitaal lezen? Kijk dan eens naar de beginnersgids op de site van\r\nereaders. Deze gids richt zich voornamelijk op de Nederlandstalige markt\r\nen maakt je snel wegwijs. Hierbij een korte samenvatting van de\r\nbelangrijkste bestandsformaten en apparaten.\r\nBestandsformaten\r\nEPUB\r\nEPUB is zeker in Europa het meest gebruikte formaat voor e-boeken.\r\nHet is een open standaard voor e-boeken. De tekst in een ePub boek is\r\nreflowable, waarmee bedoeld wordt dat er geen vaste regellengte is en\r\ndat de lengte van een regel zich aanpast aan het scherm waarop het\r\ngelezen wordt. Daarom kent ePub ook niet echt een vaste pagina, met\r\npaginanummers. Bij ePub is een pagina het gedeelte dat je op het scherm\r\nziet en dat hangt o.a. af van de gekozen schermafmetingen en\r\nlettergrootte. De meeste leveranciers van e-boeken ondersteunen het ePub\r\nformaat. Om te lezen is het ePub formaat het beste formaat. En dit\r\nformaat ondersteunt DRM, je komt dus zowel beveiligde als onbeveiligde\r\ne-boeken tegen.\r\nPDF\r\nVeel e-boeken worden in het PDF formaat uitgebracht. Dit is eigenlijk\r\ngeen special formaat voor e-boeken, maar de meeste apparaten\r\nondersteunen het lezen van het pdf formaat. Meestal ligt de regellengte\r\nbij dit formaat vast en is dus de tekst niet reflowable. Wanneer je dan\r\nhet lettertype vergroot moet je horizontaal scrollen om de tekst te\r\nkunnen lezen. Dat wordt door velen als niet prettig ervaren. Een\r\nvoordeel van het PDF formaat is dat het vergelijkbaar is met een boek,\r\nvaste pagina’s kent en ook goed uitgeprint kan worden. Veel oudere\r\nuitgave zijn alleen in PDF formaat beschikbaar.\r\nMobi\r\nDit formaat wordt gebruikt door de MobiPocket Reader. Behalve deze\r\ne-reader zijn er nog een paar andere merken die dit formaat\r\nondersteunen. Je komt het echter steeds minder tegen.\r\nAZW\r\nDit formaat is door Amazon gemaakt voor haar e-reader Kindle en lijkt\r\nerg veel op het mobi formaat. Op andere apparaten heb je hier niets aan.\r\nOp de Nederlandse markt kom je dit formaat ook nauwelijks tegen. Wel bij\r\nAmazon natuurlijk.\r\nApparaten\r\nE-readers\r\nDit zijn apparaten die speciaal ontwikkeld zijn voor het digitaal\r\nlezen. Ze hebben schermen die gebaseerd zijn op eInk, elektronische\r\ninkt, waardoor de leesbaarheid groot is. Voor de bestandsformaten ben je\r\nvolledig afhankelijk van de mogelijkheden die het betreffende apparaat\r\nheeft, je hebt geen eigen keuzes. Bij de aanschaf van een e-reader is\r\nhet dus van belang om te controleren welke bestandsformaten ondersteund\r\nworden. Bij e-boeken op de Europese markt is het van belang dat ePub en\r\npdf ondersteund worden. Verder kan het soms handig zijn dat ook MS Word\r\nbestanden en platte tekst bestanden gelezen kunnen worden, maar echt\r\nbelangrijk is dit niet.\r\nComputers / Laptops\r\nEr is inmiddels veel gratis software beschikbaar waarmee je e-boeken\r\nop een computer of laptop kunt lezen. Adobe Digital Editions, een\r\nprogramma van Adobe voor het lezen en beheren e-boeken in epub en pdf\r\nformaat, zowel met als zonder DRM. Kan gratis gebruikt worden.\r\nRegistratie bij Adobe is noodzakelijk om boeken te kunnen lezen die met\r\nDRM beschermd zijn. Calibre, een open source programma voor het beheer\r\nen het lezen van e-boeken. Kan geen met DRM beveiligde boeken lezen.\r\nVoor de browser Firefox is een EPub reader add-in beschikbaar waarmee\r\nhet ePub formaat zonder DRM gelezen kan worden. Zowel Firefox als de\r\nadd-in zijn gratis.\r\nSmartphones / tablets\r\nEr zijn veel merken smartphones, elk met een eigen besturingssysteem,\r\nzoals: iPhone OS van Apple, Android, Symbian, Blackberry en Windows\r\nMobile. De mogelijkheden die je hebt om digitaal te kunnen verschillen\r\nper besturingssysteem en nemen ook voortdurend toe. Voor zowel de iPhone\r\nals Android is software beschikbaar om epub, met en zonder DRM, te\r\nkunnen lezen. IPAD\r\nVoor de iPad is software beschikbaar waarmee je beveiligde en\r\nonbeveiligde ePub boeken kunt lezen.\r\n\r\n\r\n\r\n",
    "preview": "posts/2012-12-24-eboek-lezen/preview.png",
    "last_modified": "2022-06-08T10:14:55+02:00",
    "input_file": {},
    "preview_width": 474,
    "preview_height": 293
  },
  {
    "path": "posts/2012-12-24-excel-statistiek-beperkingen/",
    "title": "Beperkingen Excel voor statistisch gebruik",
    "description": "Statistische mogelijkheden in Excel en de beperkingen hierbij.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2012-12-24",
    "categories": [
      "excel",
      "statistiek"
    ],
    "contents": "\r\nExcel heeft een aantal beperkingen bij het uitvoeren van statistische\r\nberekeningen. Hierdoor leent Excel zich niet goed voor gebruik bij\r\nwetenschappelijk onderzoek. Voor niet al te ingewikkelde verzamelingen\r\nvan gegevens en wanneer een grote nauwkeurigheid niet van belang is, kan\r\nExcel wel worden ingezet.\r\nExcel kan gegevens alleen maar verwerken wanneer ze in een lijst\r\nstaan. In een dergelijke lijst moeten de gegevens geen fouten bevatten,\r\nwant met fouten in een lijst gaat Excel niet altijd goed om. Het maken\r\nvan een goede lijst met betrouwbare gegevens is daarom belangrijk. Bij\r\nhet invoeren van gegevens (de zogenaamde data entry) in een lijst is het\r\nraadzaam om gebruik te maken van\r\ninvoerformulieren\r\ngegevensvalidatie\r\nStatistische werbladfuncties\r\nStandaard zitten in de functiebibliotheek van Excel diverse functies\r\ndie voor een statistische analyse van gegevens te gebruiken zijn. Deze\r\nzijn te vinden in de categorie Statistische functies. Enkele veel\r\ngebruikte:\r\nGEMIDDELDE: Rekenkundige gemiddelde van een reeks\r\ngetallen.\r\nMEDIAAN: Mediaan van de waarden\r\nMODUS.ENKELV: Modus van de waarden\r\nNORMALISEREN: Berekent de z-waarde uit gemiddelde en\r\nstandaarddeviatie\r\nNORM.S.VERD: kansverdeling van de standaardnormale\r\nverdeling\r\nNORM.VERD.N: Kansverdeling van de normale\r\nverdeling\r\nSTDEV.P: standaarddeviatie van een populatie\r\nSTDEV.S: standaarddeviatie van een steekproef\r\nVAR.P: Variantie van een populatie\r\nVAR.S: Variantie van een steekproef\r\nT.DIST: T-verdeling\r\nCHIKW.VERD: Chikwadraat verdeling\r\nTREND: Berekent waarden volgens lineaire trend\r\nCORRELATIE: Berekent correlatiecoëfficient\r\nCOVARIANTIE.P: Covariantie in populatie\r\nCOVARIANTIE.S: Covariantie in steekproef\r\nBINOM.VERD: Binomiale verdeling\r\nPOISSON.VERD: Poisson verdeling\r\nBij het gebruik van deze werkbladfuncties, bijvoorbeeld voor het\r\nmaken van een betrouwbaarheidsinterval of de toetsing van een hypothese,\r\nmoet je steeds zelf de formules en de bijbehorende argumenten in het\r\nwerkblad invoeren. Dit vereist wel dat je goed weet wat je doet.\r\nEn bij de chikwadraattoetsing wordt veelvuldig gebruik gemaakt van\r\ndraaitabellen. Het goed kunnen werken daarmee is dan een vereiste.\r\nGegevensanalyse (Analysis\r\nToolpak)\r\nNaast het gebruik van werkbladfuncties heeft Excel standaard ook een\r\ninvoegtoepassing Gegevensanalyse (Analysis ToolPak) beschikbaar welke\r\neen aantal functies biedt voor het uitvoeren van (gecompliceerdere)\r\ngegevensanalyses. Een paar mogelijkheden:\r\nBeschrijvende statistiek\r\nCorrelatie\r\nCovariantie\r\nF-toets\r\nT-toets\r\nZ-toets\r\nVariantieanalyse\r\nHistogram\r\nRang en percentiel\r\nRegressie\r\nNet als bij de werkbladfuncties geldt ook hier dat je voor het\r\ngebruik over de nodige statistische kennis moet beschikken.\r\nUitbreidingen\r\nVanwege de beperkte statistische mogelijkheden van Excel zijn er vele\r\nuitbreidingen in de vorm van invoegtoepassingen (add-ins) ontwikkeld.\r\nDeze add-ins hebben naast meer functies ook vaak een handiger interface\r\n(helaas vaak alleen Engelstalig) waardoor het gebruik ervan eenvoudiger\r\nwordt in vergelijking met de werkbladfuncties. Er zijn zowel gratis als\r\ncommerciële add-ins verkrijgbaar. De prijzen van deze laatste varieren\r\nvan ca. $100 tot $1000 per licentie. Vaak zijn er wel academische\r\nlicenties beschikbaar en bijna allemaal kennen ze een gratis\r\nprobeerversie voor 30 dagen gebruik.\r\nBij de inventarisatie van het aanbod aan add-ins en beoordeling van\r\nhet gebruik hiervan in het cursusmateriaal van Softwijs is vooral\r\ngekeken naar goedkope mogelijkheden voor inzet in het HBO, dat de\r\ngrootste doelgroep van Softwijs vormt. Twee aantrekkelijke mogelijkheden\r\nzijn\r\nPHStat2, afkomstig van Prentice Hall, wordt\r\ngeleverd bij sommige van hun studieboeken.\r\nSSC-STAT, afkomstig van de universiteit van Reading\r\nVoor persoonlijk gebruik gratis.\r\n\r\n\r\n\r\n",
    "preview": "posts/2012-12-24-excel-statistiek-beperkingen/preview.png",
    "last_modified": "2022-06-08T10:14:35+02:00",
    "input_file": {},
    "preview_width": 512,
    "preview_height": 331
  },
  {
    "path": "posts/2012-09-20-studieboek-formaat/",
    "title": "Studieboek formaten",
    "description": "Zijn de digitale formaten PDF en EPUB als vervangers voor het papieren boek.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2012-09-20",
    "categories": [
      "eboek"
    ],
    "contents": "\r\nWordt\r\nhet papieren studieboek vervangen door het e-boek?\r\nEen enquête in 2012 onder bezoekers van deze website leverde het\r\nvolgende resultaat op.\r\nHoe leest u een cursusboek het liefst?\r\nAntwoord\r\nAantal\r\nPerc.\r\nIn gedrukte vorm\r\n59\r\n44%\r\nAls pdf op pc/laptop\r\n57\r\n43%\r\nAls epub op tablet (iPad, …)\r\n17\r\n13%\r\n–\r\n–\r\n–\r\nTotaal\r\n133\r\n100%\r\nPDF\r\nHet pdf formaat is het enige uitvoerformaat van Softwijs dat je kunt\r\nafdrukken, wat veel gebruikers ook nog steeds doen. Maar bij evaluaties\r\nvan cursussen blijkt dat dit snel minder wordt. Veel cursisten geven er\r\nde voorkeur aan om het cursusboek als pdf op hun eigen laptop te lezen\r\nmet het gratis programma Acrobat Reader. Dat heeft een aantal voordelen\r\nten opzichte van een papieren boek.\r\nMet het navigatievenster van Acrobat kun je snel door de\r\ninhoudsopgave bladeren en klikken op het gewenste onderdeel. De gewenste\r\npagina verschijnt dan direct in het documentvenster.\r\nJe kunt de zoekmogelijkheden van het programma gebruiken om snel een\r\nbepaald woord te vinden.\r\nJe kunt de tekst vergroten en verkleinen. Een nadeel is dan wel dat\r\nde lay-out hetzelfde blijft en de tekst zich niet aanpast aan de\r\nafmetingen van het venster.\r\nJe kunt gebruik maken van interne en externe hyperlinks die in de\r\ntekst voorkomen.\r\nEPUB\r\nHet ePub formaat is bedoeld voor het lezen op een e-reader of tablet.\r\nOok zijn er programma’s zoals het bekende Calibre om een ePub om een PC\r\nof laptop te lezen. Het scherm van een e-reader is eigenlijk te klein om\r\ner studieboeken op te lezen. Dat komt omdat in studieboeken vaak veel\r\nmeer plaatjes en tekeningen voorkomen dan in romans. Het lezen van een\r\nstudieboek op een tablet als de ipad is een stuk prettiger.\r\nDe hiervoor genoemde voordelen van een pdf heeft de ePub ook. Zo kun\r\nje van de inhoudsopgave gebruik maken en kun je de tekst doorzoeken. Bij\r\nhet vergroten en verkleinen van de lettergrootte past de tekst zich aan\r\nhet scherm aan. Een ePub heeft dan ook geen vast aantal pagina’s en het\r\nverwijzen naar een paginanummer heeft dan ook niet zoveel zin. Verder\r\nzijn de afbeeldingen vaak scherper dan in een pdf en kun je deze\r\nvergroten.\r\nOntwikkelingen\r\nSoftwijs verwacht dat voor de cursusboeken de ePub steeds meer\r\nterrein zal winnen en de nieuwe standaard voor digitale cursusboeken zal\r\nworden en volgt de ontwikkelingen op dit terrein en voert deze in\r\nwanneer ze zinvol zijn. Het toekomstige digitale cursusboek zal steeds\r\nmeer verrijkingen (geluid, video, animatie, hulp bij opgaven) bevatten\r\nen mogelijkheden tot interactie en samenwerking met medecursisten en\r\ndocent.\r\n\r\n\r\n\r\n",
    "preview": "posts/2012-09-20-studieboek-formaat/ebooks.png",
    "last_modified": "2022-06-08T10:15:16+02:00",
    "input_file": {},
    "preview_width": 290,
    "preview_height": 250
  }
]
